[
  {
    "id": "unitree",
    "name": "Unitree",
    "description": "Leading manufacturer of quadruped and humanoid robots, pioneering AI-powered robotics for consumer, educational, and industrial applications.",
    "website": "https://www.unitree.com/",
    "logo": "/images/brands/unitree-logo.svg"
  },
  {
    "id": "deep-robotics",
    "name": "Deep Robotics",
    "description": "Global quadruped robot leader focused on pioneering innovation & application of embodied AI for industrial, rescue, and research applications.",
    "website": "https://www.deeprobotics.cn/en/",
    "logo": "/images/brands/deep-robotics-logo.svg"
  },
  {
    "id": "ubtech",
    "name": "UBTech",
    "description": "Global leader in humanoid robotics and AI education, developing cutting-edge commercial and industrial humanoid robots with advanced AI capabilities.",
    "website": "https://www.ubtrobot.com/",
    "logo": "/images/brands/ubtech-logo.svg"
  },
  {
    "id": "boston-dynamics",
    "name": "Boston Dynamics",
    "description": "Pioneer in advanced robotics with 30+ years of innovation, creating industry-leading quadruped and humanoid robots for industrial, research, and defense applications.",
    "website": "https://bostondynamics.com/",
    "logo": "/images/brands/boston-dynamics-logo.svg"
  },
  {
    "id": "anybotics",
    "name": "ANYbotics",
    "description": "Swiss robotics company specializing in autonomous legged robots for industrial inspection, delivering robust solutions that enhance operational reliability through automated monitoring in harsh environments.",
    "website": "https://www.anybotics.com/",
    "logo": "/images/brands/anybotics-logo.svg"
  },
  {
    "id": "ghost-robotics",
    "name": "Ghost Robotics",
    "description": "Advanced quadrupedal unmanned ground vehicles for defense, commercial, and industrial applications. Creating versatile robotic solutions with unstoppable agility for the most critical missions.",
    "website": "https://www.ghostrobotics.io/",
    "logo": "/images/brands/ghost-robotics-logo.svg"
  },
  {
    "id": "unix-ai",
    "name": "UniX AI",
    "description": "Embodied intelligent robotics company founded in 2024 in Suzhou, China. Develops full-size wheeled and bipedal humanoid robots with Unitouch visual-tactile large model technology for commercial service applications.",
    "website": "https://www.unix-group.ai/",
    "logo": "/images/brands/unix-ai-logo.svg"
  },
  {
    "id": "rainbow-robotics",
    "name": "Rainbow Robotics",
    "description": "Founded in 2011 by researchers from KAIST Humanoid Robot Research Center, Rainbow Robotics specializes in developing advanced humanoid robotic systems. Creator of the world's first commercialized humanoid robot platform HUBO2, with robots deployed at world-class institutions like MIT and Google.",
    "website": "https://www.rainbow-robotics.com/",
    "logo": "/images/brands/rainbow-robotics-logo.svg"
  },
  {
    "id": "engineai",
    "name": "EngineAI",
    "description": "Shenzhen-based robotics company founded in 2023, specializing in general intelligent humanoid robots for research, education, industrial manufacturing, commercial services, and home applications. Develops full-stack robotics technology from core components to embodied intelligence.",
    "website": "https://www.engineai.com.cn/",
    "logo": "/images/brands/engineai-logo.svg"
  },
  {
    "id": "galaxea-ai",
    "name": "Galaxea AI",
    "description": "Beijing-based embodied intelligence company founded in 2023, focused on embodied intelligence basic models and embodied intelligent robot research and development. Vision to deploy 10 billion AI robots serving the global population with advanced teleoperation and multi-dimensional perception capabilities.",
    "website": "https://galaxea-ai.com/",
    "logo": "/images/brands/galaxea-ai-logo.svg"
  }
]