[
  {
    "id": "unitree",
    "name": "Unitree",
    "description": "Leading manufacturer of quadruped and humanoid robots, pioneering AI-powered robotics for consumer, educational, and industrial applications.",
    "website": "https://www.unitree.com/",
    "logo": "/images/brands/unitree-logo.svg",
    "imagePatterns": [
      {
        "hostname": "www.unitree.com",
        "pathname": "/images/**"
      },
      {
        "hostname": "unitree.com",
        "pathname": "/images/**"
      }
    ],
    "imageBasePath": "/images/robots/unitree/"
  },
  {
    "id": "deep-robotics",
    "name": "Deep Robotics",
    "description": "Global quadruped robot leader focused on pioneering innovation & application of embodied AI for industrial, rescue, and research applications.",
    "website": "https://www.deeprobotics.cn/en/",
    "logo": "/images/brands/deep-robotics-logo.svg",
    "imagePatterns": [
      {
        "hostname": "www.deeprobotics.cn",
        "pathname": "/**"
      },
      {
        "hostname": "deeprobotics.cn",
        "pathname": "/**"
      }
    ],
    "imageBasePath": "/images/robots/deep-robotics/"
  },
  {
    "id": "ubtech",
    "name": "UBTech",
    "description": "Global leader in humanoid robotics and AI education, developing cutting-edge commercial and industrial humanoid robots with advanced AI capabilities.",
    "website": "https://www.ubtrobot.com/",
    "logo": "/images/brands/ubtech-logo.svg"
  },
  {
    "id": "boston-dynamics",
    "name": "Boston Dynamics",
    "description": "Pioneer in advanced robotics with 30+ years of innovation, creating industry-leading quadruped and humanoid robots for industrial, research, and defense applications.",
    "website": "https://bostondynamics.com/",
    "logo": "/images/brands/boston-dynamics-logo.svg",
    "imagePatterns": [
      {
        "hostname": "bostondynamics.com",
        "pathname": "/**"
      }
    ],
    "imageBasePath": "/images/robots/boston-dynamics/"
  },
  {
    "id": "anybotics",
    "name": "ANYbotics",
    "description": "Swiss robotics company specializing in autonomous legged robots for industrial inspection, delivering robust solutions that enhance operational reliability through automated monitoring in harsh environments.",
    "website": "https://www.anybotics.com/",
    "logo": "/images/brands/anybotics-logo.svg"
  },
  {
    "id": "ghost-robotics",
    "name": "Ghost Robotics",
    "description": "Advanced quadrupedal unmanned ground vehicles for defense, commercial, and industrial applications. Creating versatile robotic solutions with unstoppable agility for the most critical missions.",
    "website": "https://www.ghostrobotics.io/",
    "logo": "/images/brands/ghost-robotics-logo.svg"
  },
  {
    "id": "unix-ai",
    "name": "UniX AI",
    "description": "Embodied intelligent robotics company founded in 2024 in Suzhou, China. Develops full-size wheeled and bipedal humanoid robots with Unitouch visual-tactile large model technology for commercial service applications.",
    "website": "https://www.unix-group.ai/",
    "logo": "/images/brands/unix-ai-logo.svg"
  },
  {
    "id": "rainbow-robotics",
    "name": "Rainbow Robotics",
    "description": "Founded in 2011 by researchers from KAIST Humanoid Robot Research Center, Rainbow Robotics specializes in developing advanced humanoid robotic systems. Creator of the world's first commercialized humanoid robot platform HUBO2, with robots deployed at world-class institutions like MIT and Google.",
    "website": "https://www.rainbow-robotics.com/",
    "logo": "/images/brands/rainbow-robotics-logo.svg"
  },
  {
    "id": "engineai",
    "name": "EngineAI",
    "description": "Shenzhen-based robotics company founded in 2023, specializing in general intelligent humanoid robots for research, education, industrial manufacturing, commercial services, and home applications. Develops full-stack robotics technology from core components to embodied intelligence.",
    "website": "https://www.engineai.com.cn/",
    "logo": "/images/brands/engineai-logo.svg"
  },
  {
    "id": "galaxea-ai",
    "name": "Galaxea AI",
    "description": "Beijing-based embodied intelligence company founded in 2023, focused on embodied intelligence basic models and embodied intelligent robot research and development. Vision to deploy 10 billion AI robots serving the global population with advanced teleoperation and multi-dimensional perception capabilities.",
    "website": "https://galaxea-ai.com/",
    "logo": "/images/brands/galaxea-ai-logo.svg"
  },
  {
    "id": "booster-robotics",
    "name": "Booster Robotics",
    "description": "Founded in June 2023 by Tsinghua University graduates, Booster Robotics develops humanoid robot products and platforms to promote productivity change. Specializes in scientific research and education scenarios with advanced software and hardware platforms for embodied intelligence.",
    "website": "https://www.boosterobotics.com/",
    "logo": "/images/brands/booster-robotics-logo.svg"
  },
  {
    "id": "tesla",
    "name": "Tesla",
    "description": "Automotive and energy company investing heavily in general-purpose humanoid robots for factory automation, leveraging its AI and manufacturing expertise. Planning deployment of 5,000 Optimus Gen 3 units in Tesla factories during 2025.",
    "website": "https://www.tesla.com/"
  },
  {
    "id": "figure-ai",
    "name": "Figure AI",
    "description": "California startup building deployable humanoids for human-scale industrial tasks with rapid commercial adoption. $2.6B valuation with robots already deployed at BMW factories, backed by Jeff Bezos, Microsoft, OpenAI, NVIDIA, and Intel.",
    "website": "https://www.figure.ai/",
    "logo": "/images/brands/figure-ai-logo.svg"
  },
  {
    "id": "agility-robotics",
    "name": "Agility Robotics",
    "description": "Commercializes bipedal robots designed to work safely alongside people in logistics. First company to build dedicated humanoid robot manufacturing facility (RoboFab) capable of 10,000 units/year, with pilots at Amazon fulfillment centers.",
    "website": "https://agilityrobotics.com/",
    "logo": "/images/brands/agility-robotics-logo.png"
  },
  {
    "id": "apptronik",
    "name": "Apptronik",
    "description": "Austin-based firm translating NASA legged research into modular workforce humanoids for industrial applications. Raised $522M with partnerships including Amazon, Mercedes-Benz, Walmart, and Jabil.",
    "website": "https://apptronik.com/",
    "logo": "/images/brands/apptronik-logo.svg"
  },
  {
    "id": "sanctuary-ai",
    "name": "Sanctuary AI",
    "description": "Canadian company combining cognition software with humanoid embodiments for real work, addressing labor challenges. Leading Canadian robotics company with mission to deploy millions of industrial-grade humanoid robots.",
    "website": "https://www.sanctuary.ai/",
    "logo": "/images/brands/sanctuary-ai-logo.png"
  },
  {
    "id": "1x-technologies",
    "name": "1X Technologies",
    "description": "Norwegian-American startup deploying androids for security and frontline services with embodied AI. EVE available at $24K, NEO Beta in home trials, backed by OpenAI with biologically-inspired design for home environments.",
    "website": "https://1x.tech/",
    "logo": "/images/brands/1x-technologies-logo.svg"
  },
  {
    "id": "fourier-intelligence",
    "name": "Fourier Intelligence",
    "description": "Rehab robotics leader expanding into full-scale humanoids with high-output actuators, dominating Asian rehabilitation market. Production capacity of 5,000 units/year, deployed in Chinese Tier-1 hospitals and European automotive factories.",
    "website": "https://www.fourierintelligence.com/",
    "logo": "/images/brands/fourier-intelligence-logo.png"
  },
  {
    "id": "pal-robotics",
    "name": "PAL Robotics",
    "description": "Barcelona robotics specialist producing humanoids for research, industry, and service roles with advanced manipulation. TALOS features 32-DOF, 1.75m tall, 7-DOF arms lifting 6kg at full extension.",
    "website": "https://pal-robotics.com/",
    "logo": "/images/brands/pal-robotics-logo.png"
  },
  {
    "id": "engineered-arts",
    "name": "Engineered Arts",
    "description": "UK studio crafting expressive humanoids for entertainment, research, and customer engagement. Ameca renowned for stunningly lifelike facial expressions, popular in exhibitions, research labs, and media productions globally.",
    "website": "https://www.engineeredarts.co.uk/",
    "logo": "/images/brands/engineered-arts-logo.svg"
  },
  {
    "id": "hanson-robotics",
    "name": "Hanson Robotics",
    "description": "Hong Kong company renowned for social humanoids with realistic facial expressions and emotional intelligence. Created Sophia, the world's most famous humanoid robot granted Saudi Arabian citizenship.",
    "website": "https://www.hansonrobotics.com/",
    "logo": "/images/brands/hanson-robotics-logo.png"
  },
  {
    "id": "sony",
    "name": "Sony",
    "description": "Electronics giant with long-running Aibo consumer quadruped platform, pioneering consumer robot dogs since 1999. Offers the most sophisticated autonomous companion robot with AI personality development.",
    "website": "https://www.sony.com/",
    "logo": "/images/brands/sony-logo.svg"
  },
  {
    "id": "xiaomi",
    "name": "Xiaomi",
    "description": "Advanced robotics group extending AIoT expertise into humanoid (CyberOne) and quadruped (CyberDog) form factors. Open-source platform with NVIDIA Jetson Xavier NX and emotional detection capabilities.",
    "website": "https://www.mi.com/global/",
    "logo": "/images/brands/xiaomi-logo.png"
  },
  {
    "id": "honda",
    "name": "Honda",
    "description": "Japanese pioneer of bipedal robotics investing in next-generation disaster-response avatars. Created foundational ASIMO which ushered in the modern humanoid robotics era before discontinuation in 2022.",
    "website": "https://global.honda/",
    "logo": "/images/brands/honda-logo.svg"
  },
  {
    "id": "hyundai",
    "name": "Hyundai Motor Group",
    "description": "Major automotive conglomerate investing heavily in robotics through 80% ownership of Boston Dynamics and internal development. DAL-e service robot operational in Hyundai showrooms for customer service.",
    "website": "https://www.hyundai.com/",
    "logo": "/images/brands/hyundai-logo.svg"
  },
  {
    "id": "softbank-robotics",
    "name": "SoftBank Robotics",
    "description": "Global service robotics firm deploying humanoids across retail, banking, and education sectors. Part of SoftBank Group with 20% Boston Dynamics stake, pioneered commercial service robots at scale with Pepper.",
    "website": "https://www.softbankrobotics.com/",
    "logo": "/images/brands/softbank-robotics-logo.svg"
  },
  {
    "id": "petoi",
    "name": "Petoi",
    "description": "Maker community-focused company producing open-source palm-sized quadruped kits for education. Successfully raised $567K on Kickstarter, offering world's first affordable programmable robot dog starting at $225.",
    "website": "https://www.petoi.com/",
    "logo": "/images/brands/petoi-logo.png"
  },
  {
    "id": "swiss-mile",
    "name": "Swiss-Mile (RIVR)",
    "description": "ETH Zurich spin-off building wheel-legged robots that switch between driving and walking for delivery. Raised $22M from Jeff Bezos, achieving 22 kph speed with 83% efficiency and 50kg payload.",
    "website": "https://www.rivr.ai/"
  },
  {
    "id": "limx-dynamics",
    "name": "LimX Dynamics",
    "description": "Guangzhou firm developing high-agility quadrupeds with force-controlled joints and transformation capabilities. W1 transforms from quadruped to biped in <1 second, reaching 36 km/h speed.",
    "website": "https://www.limxdynamics.com/",
    "logo": "/images/brands/limx-dynamics-logo.png"
  },
  {
    "id": "weilan",
    "name": "Weilan Technology",
    "description": "Shenzhen startup scaling AlphaDog quadrupeds for smart city and enterprise deployments. Claimed fastest robot dog at 15 km/h with advanced LIDAR/3D cameras, available from $2,400.",
    "website": "https://www.weilan.com/"
  },
  {
    "id": "xpeng-robotics",
    "name": "XPeng Robotics",
    "description": "XPeng-backed enterprise merging autonomous driving tech with advanced humanoid robots. Iron humanoid features 60+ joints, 200 DOF, Turing AI chip with 3,000 TOPS, deployed in XPeng factories and stores.",
    "website": "https://www.xpengrobotics.com/"
  },
  {
    "id": "neura-robotics",
    "name": "NEURA Robotics",
    "description": "German company developing cognitive robotics including collaborative robots and humanoid platforms. 4NE-1 is first humanoid designed for series production, aiming to deliver 5M robots by 2030 with NVIDIA partnership.",
    "website": "https://neura-robotics.com/",
    "logo": "/images/brands/neura-robotics-logo.svg"
  },
  {
    "id": "aeolus-robotics",
    "name": "Aeolus Robotics",
    "description": "US-based company developing autonomous dual-arm humanoid robots for service industries. Aeo features dual 7-DOF arms, UV disinfection, door opening, and elevator operation capabilities.",
    "website": "https://aeolusbot.com/"
  },
  {
    "id": "enchanted-tools",
    "name": "Enchanted Tools",
    "description": "French robotics company founded by Nao/Pepper creator developing expressive humanoid service robots. Raised €17M seed funding (largest in French robotics), with Mirokaï robots featuring expressive cat-like faces deployed in hospitals.",
    "website": "https://enchanted.tools/",
    "logo": "/images/brands/enchanted-tools-logo.svg"
  },
  {
    "id": "cloudminds",
    "name": "CloudMinds Technology",
    "description": "Cloud robotics provider delivering AI-enabled humanoid service robots for smart cities. Cloud-connected AI robotics platform active in Chinese smart city projects.",
    "website": "https://www.cloudminds.com/"
  },
  {
    "id": "gitai",
    "name": "GITAI",
    "description": "Space robotics company building humanoid telepresence systems for orbital and lunar operations. Specializes in extreme environment robotics for space applications.",
    "website": "https://gitai.tech/",
    "logo": "/images/brands/gitai-logo.png"
  },
  {
    "id": "elephant-robotics",
    "name": "Elephant Robotics",
    "description": "Service robotics company offering biomimetic pet-style quadrupeds for consumers and education. Accessible biomimetic quadrupeds available for consumer purchase.",
    "website": "https://www.elephantrobotics.com/",
    "logo": "/images/brands/elephant-robotics-logo.png"
  },
  {
    "id": "mangdang",
    "name": "MangDang Technology",
    "description": "Chinese robotics company commercializing educational quadruped robots based on Stanford Pupper design. Mini Pupper developed in collaboration with Stanford, achieving commercial success of open-source research.",
    "website": "https://www.mangdang.net/",
    "logo": "/images/brands/mangdang-logo.jpg"
  },
  {
    "id": "tencent-robotics",
    "name": "Tencent Robotics X Lab",
    "description": "Tencent research lab fusing AI and legged locomotion for advanced demo platforms. Major tech company leading AI + robotics integration research.",
    "website": "https://robotics.tencent.com/"
  },
  {
    "id": "clearpath-robotics",
    "name": "Clearpath Robotics",
    "description": "Canadian company integrating custom research robotics mobility platforms for rugged all-terrain environments. Leading provider of research-grade mobile platforms (Jackal, Warthog) worldwide.",
    "website": "https://clearpathrobotics.com/",
    "logo": "/images/brands/clearpath-robotics-logo.png"
  },
  {
    "id": "agile-robotics",
    "name": "Agile Robotics",
    "description": "US-based company developing agile quadruped robots focusing on dynamic locomotion and mobility in challenging environments for research and inspection applications.",
    "website": "https://www.agilerobotics.com/",
    "logo": "/images/brands/agile-robotics-logo.svg"
  },
  {
    "id": "h-robotics",
    "name": "H Robotics",
    "description": "South Korean robotics company developing quadruped platforms for industrial and research applications. Emerging player contributing to Asian quadruped market growth.",
    "website": "https://www.hrobotics.co.kr/"
  },
  {
    "id": "qkm-technology",
    "name": "QKM Technology",
    "description": "Shenzhen manufacturer of affordable AI-enabled mini quadrupeds for education and R&D. Provides accessible educational quadruped robots for learning and development.",
    "website": "https://www.qkmtech.com/",
    "logo": "/images/brands/qkm-technology-logo.png"
  },
  {
    "id": "toyota-research",
    "name": "Toyota Research Institute",
    "description": "Toyota's research arm advancing assistive humanoids for aging societies and remote work. Focus on assistive technology platforms for aging populations and human support.",
    "website": "https://www.tri.global/",
    "logo": "/images/brands/toyota-research-logo.svg"
  },
  {
    "id": "stanford-robotics",
    "name": "Stanford Student Robotics",
    "description": "Stanford University research group developing open-source, low-cost quadruped platforms ($600-$1,000) for education. Stanford Doggo holds record for highest vertical jumping agility among robots.",
    "website": "https://stanfordstudentrobotics.org/",
    "logo": "/images/brands/stanford-robotics-logo.png"
  },
  {
    "id": "mit-biomimetic",
    "name": "MIT Biomimetic Robotics Lab",
    "description": "MIT research lab pioneering biomimetic quadruped robotics and dynamic locomotion research. Created Mini Cheetah, the first four-legged robot capable of backflips.",
    "website": "https://biomimetics.mit.edu/",
    "logo": "/images/brands/mit-biomimetic-logo.png"
  },
  {
    "id": "nvidia",
    "name": "NVIDIA",
    "description": "Critical computing platform provider powering numerous quadruped and humanoid robots globally. Jetson Xavier NX and Isaac Platform enable AI and autonomous capabilities across the robotics industry.",
    "website": "https://www.nvidia.com/",
    "logo": "/images/brands/nvidia-logo.svg"
  },
  {
    "id": "omron",
    "name": "Omron",
    "description": "Japanese electronics and automation company developing mobile robots and automation solutions. Major automation provider expanding into mobile robotics for industrial applications and logistics.",
    "website": "https://www.omron.com/",
    "logo": "/images/brands/omron-logo.svg"
  },
  {
    "id": "kawasaki",
    "name": "Kawasaki Heavy Industries",
    "description": "Japanese industrial conglomerate adapting leg-wheel hybrids for logistics and agriculture. Applies decades of industrial robotics expertise to legged robot platforms.",
    "website": "https://global.kawasaki.com/en/industrial_equipment/robot/",
    "logo": "/images/brands/kawasaki-logo.svg"
  },
  {
    "id": "siasun",
    "name": "SIASUN Robot & Automation",
    "description": "Leading Chinese industrial robotics maker adding quadruped inspection platforms to portfolio. Largest Chinese robot manufacturer expanding into legged robots for industrial inspection.",
    "website": "https://www.siasun.com/",
    "logo": "/images/brands/siasun-logo.png"
  },
  {
    "id": "fjdynamics",
    "name": "FJDynamics",
    "description": "Global robotics company delivering sensing and automation tools including field-ready quadrupeds. Integrates advanced sensing and automation capabilities in mobile robotic platforms.",
    "website": "https://www.fjdynamics.com/",
    "logo": "/images/brands/fjdynamics-logo.jpg"
  },
  {
    "id": "hebi-robotics",
    "name": "HEBI Robotics",
    "description": "Pittsburgh-based modular robotics provider enabling custom legged systems via smart actuators. Smart actuator platform enables researchers and system integrators to build custom robotic systems.",
    "website": "https://www.hebirobotics.com/",
    "logo": "/images/brands/hebi-robotics-logo.png"
  }
]
