[
  {
    "id": "unitree",
    "name": "Unitree",
    "description": "Leading manufacturer of quadruped and humanoid robots, pioneering AI-powered robotics for consumer, educational, and industrial applications.",
    "website": "https://www.unitree.com/",
    "logo": "/images/brands/unitree-logo.svg",
    "imagePatterns": [
      {
        "hostname": "www.unitree.com",
        "pathname": "/images/**"
      },
      {
        "hostname": "unitree.com",
        "pathname": "/images/**"
      }
    ],
    "imageBasePath": "/images/robots/unitree/"
  },
  {
    "id": "deep-robotics",
    "name": "Deep Robotics",
    "description": "Global quadruped robot leader focused on pioneering innovation & application of embodied AI for industrial, rescue, and research applications.",
    "website": "https://www.deeprobotics.cn/en/",
    "logo": "/images/brands/deep-robotics-logo.svg",
    "imagePatterns": [
      {
        "hostname": "www.deeprobotics.cn",
        "pathname": "/**"
      },
      {
        "hostname": "deeprobotics.cn",
        "pathname": "/**"
      }
    ],
    "imageBasePath": "/images/robots/deep-robotics/"
  },
  {
    "id": "ubtech",
    "name": "UBTech",
    "description": "Global leader in humanoid robotics and AI education, developing cutting-edge commercial and industrial humanoid robots with advanced AI capabilities.",
    "website": "https://www.ubtrobot.com/",
    "logo": "/images/brands/ubtech-logo.svg"
  },
  {
    "id": "boston-dynamics",
    "name": "Boston Dynamics",
    "description": "Pioneer in advanced robotics with 30+ years of innovation, creating industry-leading quadruped and humanoid robots for industrial, research, and defense applications.",
    "website": "https://bostondynamics.com/",
    "logo": "/images/brands/boston-dynamics-logo.svg",
    "imagePatterns": [
      {
        "hostname": "bostondynamics.com",
        "pathname": "/**"
      }
    ],
    "imageBasePath": "/images/robots/boston-dynamics/"
  },
  {
    "id": "anybotics",
    "name": "ANYbotics",
    "description": "Swiss robotics company specializing in autonomous legged robots for industrial inspection, delivering robust solutions that enhance operational reliability through automated monitoring in harsh environments.",
    "website": "https://www.anybotics.com/",
    "logo": "/images/brands/anybotics-logo.svg"
  },
  {
    "id": "ghost-robotics",
    "name": "Ghost Robotics",
    "description": "Advanced quadrupedal unmanned ground vehicles for defense, commercial, and industrial applications. Creating versatile robotic solutions with unstoppable agility for the most critical missions.",
    "website": "https://www.ghostrobotics.io/",
    "logo": "/images/brands/ghost-robotics-logo.svg"
  },
  {
    "id": "unix-ai",
    "name": "UniX AI",
    "description": "Embodied intelligent robotics company founded in 2024 in Suzhou, China. Develops full-size wheeled and bipedal humanoid robots with Unitouch visual-tactile large model technology for commercial service applications.",
    "website": "https://www.unix-group.ai/",
    "logo": "/images/brands/unix-ai-logo.svg"
  },
  {
    "id": "rainbow-robotics",
    "name": "Rainbow Robotics",
    "description": "Founded in 2011 by researchers from KAIST Humanoid Robot Research Center, Rainbow Robotics specializes in developing advanced humanoid robotic systems. Creator of the world's first commercialized humanoid robot platform HUBO2, with robots deployed at world-class institutions like MIT and Google.",
    "website": "https://www.rainbow-robotics.com/",
    "logo": "/images/brands/rainbow-robotics-logo.svg"
  },
  {
    "id": "engineai",
    "name": "EngineAI",
    "description": "Shenzhen-based robotics company founded in 2023, specializing in general intelligent humanoid robots for research, education, industrial manufacturing, commercial services, and home applications. Develops full-stack robotics technology from core components to embodied intelligence.",
    "website": "https://www.engineai.com.cn/",
    "logo": "/images/brands/engineai-logo.svg"
  },
  {
    "id": "galaxea-ai",
    "name": "Galaxea AI",
    "description": "Beijing-based embodied intelligence company founded in 2023, focused on embodied intelligence basic models and embodied intelligent robot research and development. Vision to deploy 10 billion AI robots serving the global population with advanced teleoperation and multi-dimensional perception capabilities.",
    "website": "https://galaxea-ai.com/",
    "logo": "/images/brands/galaxea-ai-logo.svg"
  },
  {
    "id": "booster-robotics",
    "name": "Booster Robotics",
    "description": "Founded in June 2023 by Tsinghua University graduates, Booster Robotics develops humanoid robot products and platforms to promote productivity change. Specializes in scientific research and education scenarios with advanced software and hardware platforms for embodied intelligence.",
    "website": "https://www.boosterobotics.com/",
    "logo": "/images/brands/booster-robotics-logo.svg"
  },
  {
    "id": "tesla",
    "name": "Tesla",
    "description": "Automotive and energy company investing heavily in general-purpose humanoid robots for factory automation, leveraging its AI and manufacturing expertise. Planning deployment of 5,000 Optimus Gen 3 units in Tesla factories during 2025.",
    "website": "https://www.tesla.com/"
  },
  {
    "id": "figure-ai",
    "name": "Figure AI",
    "description": "California startup building deployable humanoids for human-scale industrial tasks with rapid commercial adoption. $2.6B valuation with robots already deployed at BMW factories, backed by Jeff Bezos, Microsoft, OpenAI, NVIDIA, and Intel.",
    "website": "https://www.figure.ai/",
    "logo": "/images/brands/figure-ai-logo.svg"
  },
  {
    "id": "agility-robotics",
    "name": "Agility Robotics",
    "description": "Commercializes bipedal robots designed to work safely alongside people in logistics. First company to build dedicated humanoid robot manufacturing facility (RoboFab) capable of 10,000 units/year, with pilots at Amazon fulfillment centers.",
    "website": "https://agilityrobotics.com/",
    "logo": "/images/brands/agility-robotics-logo.png"
  },
  {
    "id": "apptronik",
    "name": "Apptronik",
    "description": "Austin-based firm translating NASA legged research into modular workforce humanoids for industrial applications. Raised $522M with partnerships including Amazon, Mercedes-Benz, Walmart, and Jabil.",
    "website": "https://apptronik.com/",
    "logo": "/images/brands/apptronik-logo.svg"
  },
  {
    "id": "sanctuary-ai",
    "name": "Sanctuary AI",
    "description": "Canadian company combining cognition software with humanoid embodiments for real work, addressing labor challenges. Leading Canadian robotics company with mission to deploy millions of industrial-grade humanoid robots.",
    "website": "https://www.sanctuary.ai/",
    "logo": "/images/brands/sanctuary-ai-logo.png"
  },
  {
    "id": "1x-technologies",
    "name": "1X Technologies",
    "description": "Norwegian-American startup deploying androids for security and frontline services with embodied AI. EVE available at $24K, NEO Beta in home trials, backed by OpenAI with biologically-inspired design for home environments.",
    "website": "https://1x.tech/",
    "logo": "/images/brands/1x-technologies-logo.svg"
  },
  {
    "id": "fourier-intelligence",
    "name": "Fourier Intelligence",
    "description": "Rehab robotics leader expanding into full-scale humanoids with high-output actuators, dominating Asian rehabilitation market. Production capacity of 5,000 units/year, deployed in Chinese Tier-1 hospitals and European automotive factories.",
    "website": "https://www.fourierintelligence.com/",
    "logo": "/images/brands/fourier-intelligence-logo.png"
  },
  {
    "id": "pal-robotics",
    "name": "PAL Robotics",
    "description": "Barcelona robotics specialist producing humanoids for research, industry, and service roles with advanced manipulation. TALOS features 32-DOF, 1.75m tall, 7-DOF arms lifting 6kg at full extension.",
    "website": "https://pal-robotics.com/",
    "logo": "/images/brands/pal-robotics-logo.png"
  },
  {
    "id": "engineered-arts",
    "name": "Engineered Arts",
    "description": "UK studio crafting expressive humanoids for entertainment, research, and customer engagement. Ameca renowned for stunningly lifelike facial expressions, popular in exhibitions, research labs, and media productions globally.",
    "website": "https://www.engineeredarts.co.uk/",
    "logo": "/images/brands/engineered-arts-logo.svg"
  },
  {
    "id": "hanson-robotics",
    "name": "Hanson Robotics",
    "description": "Hong Kong company renowned for social humanoids with realistic facial expressions and emotional intelligence. Created Sophia, the world's most famous humanoid robot granted Saudi Arabian citizenship.",
    "website": "https://www.hansonrobotics.com/",
    "logo": "/images/brands/hanson-robotics-logo.png"
  },
  {
    "id": "sony",
    "name": "Sony",
    "description": "Electronics giant with long-running Aibo consumer quadruped platform, pioneering consumer robot dogs since 1999. Offers the most sophisticated autonomous companion robot with AI personality development.",
    "website": "https://www.sony.com/",
    "logo": "/images/brands/sony-logo.svg"
  },
  {
    "id": "xiaomi",
    "name": "Xiaomi",
    "description": "Advanced robotics group extending AIoT expertise into humanoid (CyberOne) and quadruped (CyberDog) form factors. Open-source platform with NVIDIA Jetson Xavier NX and emotional detection capabilities.",
    "website": "https://www.mi.com/global/",
    "logo": "/images/brands/xiaomi-logo.png"
  },
  {
    "id": "softbank-robotics",
    "name": "SoftBank Robotics",
    "description": "Global service robotics firm deploying humanoids across retail, banking, and education sectors. Part of SoftBank Group with 20% Boston Dynamics stake, pioneered commercial service robots at scale with Pepper.",
    "website": "https://www.softbankrobotics.com/",
    "logo": "/images/brands/softbank-robotics-logo.svg"
  },
  {
    "id": "honda",
    "name": "Honda",
    "description": "Japanese pioneer of bipedal robotics investing in next-generation disaster-response avatars. Created foundational ASIMO which ushered in the modern humanoid robotics era before discontinuation in 2022.",
    "website": "https://global.honda/",
    "logo": "/images/brands/honda-logo.svg"
  },
  {
    "id": "petoi",
    "name": "Petoi",
    "description": "Maker community-focused company producing open-source palm-sized quadruped kits for education. Successfully raised $567K on Kickstarter, offering world's first affordable programmable robot dog starting at $225.",
    "website": "https://www.petoi.com/",
    "logo": "/images/brands/petoi-logo.png"
  },
  {
    "id": "swiss-mile",
    "name": "Swiss-Mile (RIVR)",
    "description": "ETH Zurich spin-off building wheel-legged robots that switch between driving and walking for delivery. Raised $22M from Jeff Bezos, achieving 22 kph speed with 83% efficiency and 50kg payload.",
    "website": "https://www.rivr.ai/"
  },
  {
    "id": "limx-dynamics",
    "name": "LimX Dynamics",
    "description": "Guangzhou firm developing high-agility quadrupeds with force-controlled joints and transformation capabilities. W1 transforms from quadruped to biped in <1 second, reaching 36 km/h speed.",
    "website": "https://www.limxdynamics.com/",
    "logo": "/images/brands/limx-dynamics-logo.png"
  },
  {
    "id": "weilan",
    "name": "Weilan Technology",
    "description": "Shenzhen startup scaling AlphaDog quadrupeds for smart city and enterprise deployments. Claimed fastest robot dog at 15 km/h with advanced LIDAR/3D cameras, available from $2,400.",
    "website": "https://www.weilan.com/"
  },
  {
    "id": "xpeng-robotics",
    "name": "XPeng Robotics",
    "description": "XPeng-backed enterprise merging autonomous driving tech with advanced humanoid robots. Iron humanoid features 60+ joints, 200 DOF, Turing AI chip with 3,000 TOPS, deployed in XPeng factories and stores.",
    "website": "https://www.xpengrobotics.com/"
  },
  {
    "id": "neura-robotics",
    "name": "NEURA Robotics",
    "description": "German company developing cognitive robotics including collaborative robots and humanoid platforms. 4NE-1 is first humanoid designed for series production, aiming to deliver 5M robots by 2030 with NVIDIA partnership.",
    "website": "https://neura-robotics.com/",
    "logo": "/images/brands/neura-robotics-logo.svg"
  },
  {
    "id": "elephant-robotics",
    "name": "Elephant Robotics",
    "description": "Service robotics company offering biomimetic pet-style quadrupeds for consumers and education. Accessible biomimetic quadrupeds available for consumer purchase.",
    "website": "https://www.elephantrobotics.com/",
    "logo": "/images/brands/elephant-robotics-logo.png"
  },
  {
    "id": "openloong-galaxea-ai",
    "name": "GALAXEA AI",
    "chineseName": "星海图（GALAXEA AI）",
    "description": "GALAXEA AI is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "https://galaxea-dynamics.com",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "openloong-leju-robotics",
    "name": "Leju Robotics",
    "chineseName": "乐聚机器人",
    "description": "Leju Robotics is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "https://www.lejurobot.com",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "openloong-engineai",
    "name": "EngineAI",
    "chineseName": "众擎机器人",
    "description": "EngineAI is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "http://www.engineai.com.cn",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "openloong-shanghai-kepler-exploration-robotics",
    "name": "Shanghai Kepler Exploration Robotics",
    "chineseName": "上海开普勒探索机器人有限公司",
    "description": "Shanghai Kepler Exploration Robotics is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "https://www.gotokepler.com",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "openloong-astribot-stardust-intelligence-",
    "name": "Astribot (Stardust Intelligence)",
    "chineseName": "星尘智能",
    "description": "Astribot (Stardust Intelligence) is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "https://www.astribot.com",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "openloong-paxini",
    "name": "PaXini",
    "chineseName": "帕西尼感知科技",
    "description": "PaXini is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "https://paxini.com",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "openloong-shanghai-zhuoyide-robot-droidup-",
    "name": "Shanghai Zhuoyide Robot (DroidUp)",
    "chineseName": "上海卓益得机器人有限公司",
    "description": "Shanghai Zhuoyide Robot (DroidUp) is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "https://www.droidup.com",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "openloong-noetix-robotics",
    "name": "Noetix Robotics",
    "chineseName": "松延动力",
    "description": "Noetix Robotics is a Chinese robotics manufacturer specializing in humanoid robot development.",
    "website": "https://noetixrobotics.com",
    "logo": "",
    "source": "official_website",
    "country": "China",
    "needsManualEnrichment": false
  },
  {
    "id": "agibot",
    "name": "AgiBot",
    "description": "Shanghai-based robotics company developing advanced commercial humanoid robots. AgiBot A2 holds the Guinness World Record for longest humanoid robot walk (106.286 km), featuring 28 motors, hot-swappable batteries, and AI-powered multilingual capabilities for customer service applications.",
    "website": "https://www.agibot.com/",
    "logo": "/images/brands/agibot-logo.svg",
    "country": "China",
    "founded": "2023"
  },
  {
    "id": "k-scale-labs",
    "name": "K-Scale Labs",
    "description": "Y Combinator-backed robotics company building open-source humanoid robots to democratize robotics. Offers K-Bot ($9,000) and Z-Bot ($1,000) with Python SDK, Raspberry Pi-based computing, and comprehensive GitHub support for developers, researchers, and education.",
    "website": "https://www.kscale.dev/",
    "logo": "/images/brands/kscale-labs-logo.svg",
    "country": "USA",
    "founded": "2024"
  },
  {
    "id": "mentee-robotics",
    "name": "Mentee Robotics",
    "description": "Israeli robotics company developing AI-first vertically integrated humanoid robots with Real2Sim2Real technology. Being acquired by Mobileye for $900M, MenteeBot features advanced scene understanding, autonomous task execution, and proprietary actuators for real-world usefulness and adaptability.",
    "website": "https://www.menteebot.com/",
    "logo": "/images/brands/mentee-robotics-logo.svg",
    "country": "Israel",
    "founded": "2020"
  },
  {
    "id": "vinmotion",
    "name": "VinMotion",
    "description": "Vietnamese robotics company and Vingroup subsidiary developing humanoid robots for service applications. Motion 2 features 24/7 autonomous operation with self-charging, 40kg payload capacity, and multilingual AI communication powered by Qualcomm processors.",
    "website": "https://vinmotion.net/",
    "logo": "/images/brands/vinmotion-logo.svg",
    "country": "Vietnam",
    "founded": "2022"
  },
  {
    "id": "pollen-robotics",
    "name": "Pollen Robotics",
    "description": "French robotics company acquired by Hugging Face, specializing in open-source humanoid robots for research and education. Reachy 2 features modular design, VR teleoperation, ROS2 integration, and serves as a platform for embodied AI experiments at top universities.",
    "website": "https://www.pollen-robotics.com/",
    "logo": "/images/brands/pollen-robotics-logo.svg",
    "country": "France",
    "founded": "2016"
  },
  {
    "id": "lg-electronics",
    "name": "LG Electronics",
    "description": "Global electronics and appliance leader expanding into home robotics with AI-powered humanoid assistants. CLOiD humanoid integrates with LG ThinQ smart home ecosystem for Zero Labor Home vision, featuring dual articulated arms and vision-language AI for household chores.",
    "website": "https://www.lg.com/",
    "logo": "/images/brands/lg-electronics-logo.svg",
    "country": "South Korea",
    "founded": "1958"
  },
  {
    "id": "switchbot",
    "name": "SwitchBot",
    "description": "Smart home automation company pioneering home-service humanoid robots with vision-language-action AI. Onero H1 is designed for real-world household manipulation tasks like laundry folding and table clearing, featuring on-device AI processing and 22 degrees of freedom.",
    "website": "https://www.switch-bot.com/",
    "logo": "/images/brands/switchbot-logo.svg",
    "country": "China",
    "founded": "2016"
  },
  {
    "id": "lem-surgical",
    "name": "LEM Surgical",
    "description": "Swiss medical robotics company developing humanoid-style dual-arm surgical robot systems. Dynamis is FDA-cleared for spine and orthopedic procedures with bimanual manipulation, sub-millimeter accuracy, and 3D vision synchronized with surgical arm movements.",
    "website": "https://www.lemsurgical.com/",
    "logo": "/images/brands/lem-surgical-logo.svg",
    "country": "Switzerland",
    "founded": "2015"
  },
  {
    "id": "dobot",
    "name": "Dobot",
    "description": "Industrial and educational robotics manufacturer expanding into consumer quadruped robots. Rover X1 is a voice-controlled robot dog designed for home assistance and companionship, featuring hybrid wheel-leg design, auto-follow mode, and one of the most affordable price points in the category.",
    "website": "https://www.dobot.cc/",
    "logo": "/images/brands/dobot-logo.svg",
    "country": "China",
    "founded": "2015"
  },
  {
    "id": "diligent-robotics",
    "name": "Diligent Robotics",
    "description": "Healthcare robotics company deploying autonomous mobile manipulator robots in hospitals. Founded by MIT and Georgia Tech social robotics experts, Moxi robots handle logistics tasks, completing over 1.25 million deliveries across 25+ U.S. hospitals. Acquired by Serve Robotics in January 2026.",
    "website": "https://www.diligentrobots.com/",
    "logo": "/images/brands/diligent-robotics-logo.svg",
    "country": "USA",
    "founded": "2017"
  },
  {
    "id": "serve-robotics",
    "name": "Serve Robotics",
    "description": "Publicly traded sidewalk delivery robotics company with the largest autonomous delivery fleet in the U.S. Spun off from Postmates in 2021, deploys 2,000+ Level 4 autonomous robots for last-mile delivery with Uber Eats, DoorDash, and major retail partners. Targeting $1 per delivery cost at scale.",
    "website": "https://www.serverobotics.com/",
    "logo": "/images/brands/serve-robotics-logo.svg",
    "country": "USA",
    "founded": "2017"
  },
  {
    "id": "andromeda-robotics",
    "name": "Andromeda Robotics",
    "description": "Australian robotics company building emotionally intelligent humanoid companions for aged care. Abi robot leverages ChatGPT-4, speaks 90+ languages, and combats loneliness in healthcare settings. Valued at $100M with $19.2M funding, deployed in Australian aged care facilities with U.S. expansion underway.",
    "website": "https://andromedarobotics.ai/",
    "logo": "/images/brands/andromeda-robotics-logo.svg",
    "country": "Australia",
    "founded": "2022"
  },
  {
    "id": "fauna-robotics",
    "name": "Fauna Robotics",
    "description": "NYC-based robotics company building humanoid robots that operate everywhere people do. Sprout is a safe, lightweight humanoid development platform with 29 DoF, NVIDIA Jetson AGX Orin compute, and soft exterior panels designed for unstructured environments.",
    "website": "https://faunarobotics.com/",
    "logo": "",
    "country": "USA"
  },
  {
    "id": "august-robotics",
    "name": "August Robotics",
    "description": "Autonomous mobile robot company specializing in industrial floor operations. Creator of the Lionel robot platform for exhibition floor marking and construction drilling, with over 1 million marks recorded globally and deployed across exhibitions, construction sites, and industrial projects.",
    "website": "https://augustrobotics.com/",
    "logo": "",
    "country": "USA"
  }
]