{
  "fetch_date": "2026-01-26T11:10:38.776Z",
  "week_range": "Jan 19–25",
  "articles": {
    "ieee": [],
    "robotreport": [
      {
        "title": "Hadrian raises funding for automated manufacturing, bringing valuation to $1.6B",
        "link": "https://www.therobotreport.com/hadrian-brings-in-additional-funding-bringing-its-valuation-to-1-6b/",
        "pubDate": "2026-01-25T13:30:38.000Z",
        "content": "A rendering of a planned Hadrian facility in Mesa, Ariz. [https://www.therobotreport.com/wp-content/uploads/2026/01/Hadrian-factory-featured.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/Hadrian-factory-featured.jpg A rendering of one of Hadrian’s announced facilities in Mesa, Ariz. | Source: Hadrian Hadrian, which uses AI-powered automation and modern software to build manufacturing facilities for aerospace, defense, and emerging industrial programs, recently announced expanded capital. With the latest investment, the company is valued at $1.6 billion. Hadrian said it plans to use the funding to accelerate factory expansion and advance its automated manufacturing roadmap. “For decades, the United States separated design from production and assumed global supply chains would carry the load,” stated Chris Power, the founder and CEO of Hadrian. “That assumption no longer holds,” he said. “This capital accelerates our ability to build the industrial capacity America needs by pairing advanced automation with workforce training designed for the scale of the opportunity in front of us.” OPUS DESIGNED TO PROPEL RESHORING OF MANUFACTURING Demand for domestic manufacturing [https://www.therobotreport.com/category/markets-industries/manufacturing/] capacity across aerospace, defense, and critical infrastructure continues to grow, noted Hadrian. The company [https://www.hadrian.co/] said it is building advanced factories designed to produce mission-critical components, assemblies, and full product lines with speed, reliability, and scale. Hadrian said its platform pairs advanced automation with a rapidly trained workforce to meet the urgent need for a generational re-industrialization effort. This is part of its factories-as-a-service (FaaS) initiative. Opus, Hadrian’s proprietary software stack for production autonomy, powers its factories. It said its manufacturing facilities can go online in under six months. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- HADRIAN BUILDS ON FUNDING TO EXPAND DEFENSE PRODUCTION Hadrian said the latest capital will position it to move faster in scaling high-throughput American factories. The investment was led by accounts advised by T. Rowe Price Associates Inc. It included participation from Altimeter Capital, D1 Capital Partners, StepStone Group, 1789 Capital, Founders Fund, Lux Capital, a16z, Construct Capital, and existing investors. This funding builds on a $260 million round [https://www.prnewswire.com/news-releases/hadrian-raises-260m-to-build-ai-powered-factories-for-america-adds-full-product-manufacturing-opens-arizona-site-302508179.html] from July 2025. Hadrian used that investment to support nearly five football fields’ worth of new manufacturing space, expanded research and development capacity, and dedicated teams focused on shipbuilding and naval [https://www.therobotreport.com/category/maritime/] defense production. Hadrian said it plans to use the latest capital to: * Accelerate factory expansion * Scale workforce training programs * Continue investment in automation, AI [https://www.therobotreport.com/category/design-development/ai-cognition/]-driven tooling, and real-time manufacturing intelligence Last week, Hadrian launched [https://www.prnewswire.com/news-releases/hadrian-launches-additive-manufacturing-division-to-expand-us-defense-production-capacity-302668241.html] Hadrian Additive, a division dedicated to delivering scalable, production-ready additive manufacturing capacity for the U.S. defense [https://www.therobotreport.com/category/markets-industries/defense-security/] industrial base and allied partners. The new division expands Hadrian’s Opus platform to include 3D printing systems built for qualification, repeatability, and sustained throughput. It is intended to enable defense programs to move from validated designs into reliable, at-scale production. Initial additive manufacturing capacity is expected to come online in 2026 as part of Hadrian’s expanding U.S. factory footprint. The post Hadrian raises funding for automated manufacturing, bringing valuation to $1.6B [https://www.therobotreport.com/hadrian-brings-in-additional-funding-bringing-its-valuation-to-1-6b/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "Hadrian plans to use the funding to accelerate factory expansion and advance the company's manufacturing roadmap.\nThe post Hadrian raises funding for automated manufacturing, bringing valuation to $1."
      },
      {
        "title": "1X launches world model enabling NEO robot to learn tasks by watching videos",
        "link": "https://www.therobotreport.com/1x-launches-world-model-enabling-neo-robot-to-learn-tasks-by-watching-videos/",
        "pubDate": "2026-01-24T13:30:47.000Z",
        "content": "A NEO robot from 1X dusting shelves. [https://www.therobotreport.com/wp-content/uploads/2026/01/1X_NEO-Home-Duster-featured.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/1X_NEO-Home-Duster-featured.jpg 1X said its new world model puts it a step closer to a future where robots can teach themselves to do any task a human can do. | Source: 1X Technologies 1X Technologies AS last week announced its latest 1X World Model. The company said the AI update for NEO enables the humanoid robot to turn any request into an AI capability on demand, using a video model grounded in real-world physics. “After years of developing our World Model and making NEO’s [https://www.1x.tech/neo] design as close to human as possible, NEO can now learn from internet-scale video and apply that knowledge directly to the physical world,” said Bernt Børnich, founder and CEO of 1X. “With the ability to transform any prompt into new actions—even without prior examples—this marks the starting point of NEO’s ability to teach itself to master nearly anything you could think to ask.” With this update, 1X said NEO can use video data fine-tuned on robot data to perform AI tasks, even with objects and environments it has never encountered before. The Palo Alto, Calif.-based company [https://www.therobotreport.com/tag/1x-technologies/] said it has designed NEO for household [https://www.therobotreport.com/tag/household/] use. The humanoid [https://www.therobotreport.com/category/robots-platforms/humanoids/] is available through 1X’s early access program for $20,000, which includes priority delivery in 2026. A subscription model will also be available for $499/month. NEO CAN DO OLD TASKS IN UNFAMILIAR PLACES, PLUS LEARN NEW ONES With this update, users can give NEO a simple voice or text prompt, and the robot uses what it’s looking at to generate visualizations of future actions. A built-in inverse dynamics model then translates these into precise movements for NEO to complete the request, 1X explained. “With the 1X World Model, you can turn any prompt into a fully autonomous robot action — even with tasks and objects NEO’s never seen before,” said Daniel Ho, an AI researcher at 1X. Demonstrations in 1X’s latest video (below) demonstrate NEO’s ability to generalize beyond training data. For simple prompts like packing a lunch box, it visualizes and executes, even with unfamiliar objects. The robot can also handle completely novel tasks, such as operating a toilet seat, opening a sliding door, ironing a shirt, brushing a human’s hair, and more, without any prior examples in its dataset, said 1X. This highlights the transfer of broad human knowledge through the World Model, 1X said. 1X SAYS ROBOT CAN LEARN ON ITS OWN Where traditional AI [https://www.therobotreport.com/category/design-development/ai-cognition/] models for humanoid robots have relied on data collected by human operators, the 1X World Model enables NEO to collect its own data and autonomously master new capabilities. This opens the door for robots to eventually teach themselves anything, 1X claimed. Where improvement in AI capabilities for humanoids has been bottlenecked by the speed in which robot data can be collected by human operators, 1X said its World Model doesn’t only self improve from NEO collecting it’s own data. It also benefits from the improvement of video models, given that the world model uses a video model at its core. Traditional models have historically struggled with changes in lighting, clutter, or chaos that are commonplace in the home. The 1X World Model applies human-like understanding to navigate extreme variability, maintaining composure amid rapid environmental shifts, according to the company. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- The post 1X launches world model enabling NEO robot to learn tasks by watching videos [https://www.therobotreport.com/1x-launches-world-model-enabling-neo-robot-to-learn-tasks-by-watching-videos/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "With this update, 1X Technologies' NEO uses internet-scale video data tuned on robot data to perform AI tasks.\nThe post 1X launches world model enabling NEO robot to learn tasks by watching videos app"
      },
      {
        "title": "Thomas Pilz on innovation and safety in robotics",
        "link": "https://www.therobotreport.com/thomas-pilz-on-innovation-and-safety-in-robotics/",
        "pubDate": "2026-01-23T20:50:56.000Z",
        "content": "The Robot Report Podcast [https://soundcloud.com/robot-report-podcast] · Thomas Pilz on Innovation and Safety in Robotics [https://soundcloud.com/robot-report-podcast/thomas-pilz-on-innovation-and-safety-in-robotics] In Episode 228 of The Robot Report Podcast, hosts Steve Crowe and Mike Oitzman recap the major robotics news of the week. headshot of thomas pilz. [https://www.therobotreport.com/wp-content/uploads/2026/01/thomas-pilz-headshot-250.jpg] Thomas Pilz, managing partner of Pilz GmbH & Co. KG Our guest on this show is Thomas Pilz, managing partner of Pilz GmbH & Co. KG [https://www.therobotreport.com/tag/pilz/] — a dynamic leader and innovator in robotics safety. He oversees IT, purchasing, research and development, quality management, and production. Pilz previously served as CEO of Pilz Automation Safety L.P. in Michigan, leading the company’s North American operations. He also contributes to several technical and scientific boards, including the VDMA [https://www.vdma.eu/en/] and various research associations in the fields of automation and microelectronics. During the interview, we touch on current concerns with the rapidly evolving robotic landscape. We gather Thomas’ insights into new cutting-edge technologies like those being developed by 3Laws [https://www.therobotreport.com/tag/3laws/]. ---------------------------------------- SHOW TIMELINE * 0:45 – John Deere Excavator demo recap * 10:21 – News of the week * 33:25 – Thomas Pilz, Managing Partner of Pilz GmbH & Co. KG ---------------------------------------- mike oitzman sits in the cab of a John Deere 230P excavator. [https://www.therobotreport.com/wp-content/uploads/2026/01/mike-on-a-jd-230p-excavator.jpg] Editor and cohost Mike Oitzman gets his first opportunity to operate a John Deere excavator. | Credit: The Robot Report NEWS OF THE WEEK IROBOT EMERGES FROM CHAPTER 11 AS RESTRUCTURED PICEA U.S. SUBSIDIARY [https://www.therobotreport.com/irobot-emerges-from-chapter-11-picea-u-s-subsidiary/] iRobot Corp. is back from bankruptcy with the completion of Shenzhen Picea Robotics Co.’s acquisition of the consumer robotics pioneer. iRobot said it has emerged from a pre-packaged Chapter 11 process “with an improved financial foundation and additional capacity to invest in the next generation of smart home robotics.” Last month, iRobot announced that it had entered into a restructuring support agreement with its creditor Santrum Hong Kong Co. and contract manufacturer Picea. The company had faced falling revenue, diversification challenges, and antitrust concerns that doomed its proposed acquisition by Amazon. However, it said it remains committed to continuing to produce and support its fleet of millions of robotic vacuum cleaners. SERVE ROBOTICS TO ACQUIRE HOSPITAL LOGISTICS PROVIDER DILIGENT ROBOTICS [https://www.therobotreport.com/serve-robotics-acquires-diligent-robotics/] Serve Robotics Inc., a developer of sidewalk delivery robots, is acquiring Diligent Robotics Inc. for $29 million. The companies said the acquisition will open up new opportunities. With the Diligent acquisition, Serve Robotics is making its first foray into indoor environments, mobile manipulation, and the healthcare industry. Diligent currently operates its Moxi robots in more than 25 hospitals, where robots have completed over 1.25 million deliveries of medical supplies. Serve Robotics said it has spent the past year rapidly expanding the number of robots it has operating in the world, doing real work. With this experience, CEO Ali Kashani said he hopes to use Serve’s scaling and manufacturing capabilities to help Diligent Robotics to do the same. MICROSOFT RESEARCH REVEALS RHO-ALPHA VISION-LANGUAGE-ACTION MODEL FOR ROBOTS [https://www.therobotreport.com/microsoft-research-reveals-rho-alpha-vision-language-action-model-for-robots/] Microsoft announced Rho-alpha, or ρα, the first robotics model derived from its Phi series of vision-language models (VLAs). The new models built on Phi are intended to make robots more adaptable and trustworthy, the company said. “Rho-alpha translates natural language commands into control signals for robotic systems performing bimanual manipulation tasks,” wrote Ashley Llorens, corporate vice president and managing director of the Microsoft Research Accelerator. “It can be described as a VLA+ model in that it expands the set of perceptual and learning modalities beyond those typically used by VLAs.” For perception, Rho-alpha adds tactile sensing, and Microsoft said it is working to include modalities such as force. For learning, the company claimed that Rho-alpha can continually improve with feedback provided by people. Microsoft said it is looking to work with robotics manufacturers, integrators, and end users to see how Rho-alpha and associated tooling can help them train, deploy, and adapt cloud-hosted physical AI with their own data. HYUNDAI MOTOR’S KOREAN UNION WARNS OF HUMANOID ROBOT PLAN, SEES THREAT TO JOBS While South Korea is a leading adopter of industrial and service robots, fears of job displacement exist there as well as in other regions. Hyundai Motor Group [https://www.therobotreport.com/tag/hyundai-motor-group/]‘s labor union warned the automaker not to deploy humanoid [https://www.therobotreport.com/category/robots-platforms/humanoids/] robots without its approval because of concerns about “employment shocks,” reported [https://www.reuters.com/business/world-at-work/hyundai-motors-korean-union-warns-humanoid-robot-plan-sees-threat-jobs-2026-01-22/] Reuters. Hyundai is the owner of Boston Dynamics and has said it plans [https://www.therobotreport.com/hyundai-purchase-tens-of-thousands-boston-dynamics-robots/] to buy “tens of thousands” of robots in the coming years. Boston Dynamics [https://www.therobotreport.com/tag/boston-dynamics/] is also testing its Atlas humanoid with Hyundai. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- The post Thomas Pilz on innovation and safety in robotics [https://www.therobotreport.com/thomas-pilz-on-innovation-and-safety-in-robotics/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "The podcast guest this week is Thomas Pilz, managing partner of Pilz GmbH & Co. KG.\nThe post Thomas Pilz on innovation and safety in robotics appeared first on The Robot Report."
      },
      {
        "title": "Registration opens for Robotics Summit & Expo 2026",
        "link": "https://www.therobotreport.com/registration-opens-for-robotics-summit-expo-2026/",
        "pubDate": "2026-01-23T18:04:46.000Z",
        "content": "[https://www.therobotreport.com/wp-content/uploads/2026/01/robotics-summit-2026-registration.png] Registration is now open for the Robotics Summit & Expo [http://www.roboticssummit.com], the world’s leading technical event for commercial robotics developers. The event takes place May 27-28 in Boston at the Thomas M. Menino Convention and Exhibition Center. The Robotics Summit & Expo is produced by The Robot Report and parent company WTWH Media. The Robotics Summit & Expo brings together the brightest minds in commercial robotics development. Our conference programming will provide engineers the information they need to develop and scale the next generation of commercial robots. Buy your full conference pass before March 2 to save and gain full access to all keynotes, technical sessions, networking receptions and special events. Discounts are also available for academia, associations, and corporate groups. Please email events[at]wtwhmedia.com for more details about our discount programs. MassRobotics [http://www.massrobotics.org], the world’s largest independent robotics hub dedicated to accelerating robotics innovation, commercialization and adoption, is the strategic partner of the Robotics Summit & Expo. ROBOTICS SUMMIT & EXPO CONFERENCE PROGRAMMING The Robotics Summit & Expo will have more than 50 sessions in tracks on artificial intelligence, design and development, enabling technologies, healthcare, and logistics. The Engineering Theater on the show floor will also feature presentations by industry experts. There will be 70-plus speakers confirmed from companies such as Agility Robotics, Amazon Robotics, ASTM International, AWS, Brain Corp, Fictiv, GM, Harmonic Drive, maxon, PickNik Robotics, QNX, RealSense, Robotics and AI Institute, Robust AI, Tesla, Toyota Research Institute, Universal Robots, and more. We will announce the full agenda soon. Stay tuned. The event will feature the following keynotes: What Makes a Robot Worthy? Speaker: Mikell Taylor, director of robotics strategy, GM The robotics industry is at an inflection point of opportunity, but continued growth relies on more than just novelty and excitement about advanced technology. Real impact will depend on robots being worthy of trust and adoption into environments with incredibly high bars for safety, uptime, performance, and results. Mikell draws on her experience at startups developing technology for customers big and small, as well as experience in leadership roles at companies like General Motors and Amazon, to urge the industry to focus on areas of robotics that can unlock exponential growth while avoiding stagnation in “pilot purgatory.” Building Reliable Robots at Scale — Safety, Determinism, and Real-Time Performance Speakers: QNX and industry-leading robotics manufacturers In this keynote panel, executives will share how they architect performance across control, perception, and networking, and how certified processes can compress time to market for safety-relevant systems. We’ll cover practical trade-offs when combining ROS 2 with hard real-time workloads. Attendees will leave with concrete patterns for building and validating reliable robotic systems. The Rise of Large Behavior Models in Robotics Speaker: Russ Tedrake, senior vice president of large behavior models, Toyota Research Institute Russ Tedrake will present TRI’s latest advances in large behavior models and their role in scaling robot intelligence. The keynote will explore how these models enable more robust, adaptive, and high-performance robotic systems across complex real-world tasks. Interview with Noland Arbaugh, world’s first Neuralink user In this keynote interview, I will sit down with Noland Arbaugh, the world’s first Neuralink user, for a firsthand discussion of brain–computer interface (BCI) technology. The conversation will explore how the system works, the impact it has had on Noland’s daily life, and what this breakthrough signals for the future of BCI-enabled robotics and human–machine interaction. INTERACTIVE EXPO FLOOR The expo hall at the Robotics Summit will have more than 250 exhibitors [https://rsedtb2026.mapyourshow.com/8_0/floorplan/index.cfm] showcasing the latest enabling technologies, products, and services that can help robotics engineers throughout their development journeys. Tennibot will be returning to allow attendees to play tennis on the showfloor with the help of a robotic trainer. The RBR50 Showcase returns for its third year to highlight winners of the annual RBR50 Robotics Innovation Awards. The Robotics Summit also offers numerous networking opportunities, a career fair, a robotics development challenge, and much more. CO-LOCATED EVENTS The Robotics Summit will be co-located with DeviceTalks Boston [https://boston.devicetalks.com/], the premier industry event for medical technology professionals, currently in its ninth year. Both events attract engineering and business professionals from a broad range of healthcare and medical technology backgrounds. SPONSORSHIP OPPORTUNITIES For information about sponsorship and exhibition opportunities, download the prospectus [https://www.roboticssummit.com/sponsorship-opportunities/]. Questions regarding sponsorship opportunities should be directed to Colleen Sepich at csepich[AT]wtwhmedia.com. The post Registration opens for Robotics Summit & Expo 2026 [https://www.therobotreport.com/registration-opens-for-robotics-summit-expo-2026/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "Agility Robotics, Amazon Robotics, ASTM International, AWS, Brain Corp, GM, Harmonic Drive, maxon, PickNik Robotics, QNX, RealSense, Robust AI, Tesla, Toyota Research Institute, Universal Robots, and "
      },
      {
        "title": "iRobot emerges from Chapter 11 as restructured Picea U.S. subsidiary",
        "link": "https://www.therobotreport.com/irobot-emerges-from-chapter-11-picea-u-s-subsidiary/",
        "pubDate": "2026-01-23T16:49:28.000Z",
        "content": "The iRobot Roomba i7+ with Imprint Smart Mapping gives users control to choose which rooms are cleaned and when. Picea Robotics has made iRobot a wholly owned subsidiary. [https://www.therobotreport.com/wp-content/uploads/2026/01/Roombai7withImp.jpg] iRobot and Picea have set up a U.S. subsidiary to safeguard customer data. Source: iRobot iRobot Corp. is back from bankruptcy with the completion of Shenzhen Picea Robotics Co.’s acquisition of the consumer robotics pioneer. iRobot said it has emerged from a pre-packaged Chapter 11 process “with an improved financial foundation and additional capacity to invest in the next generation of smart home robotics.” Last month, iRobot announced [https://www.therobotreport.com/irobot-to-enter-chapter-11-acquired-chinese-creditor/] that it had entered into a restructuring support agreement with its creditor [https://www.therobotreport.com/irobot-debt-acquired-by-contract-manufacturer-as-bankruptcy-looms/] Santrum Hong Kong Co. and contract manufacturer Picea. The company [https://www.therobotreport.com/tag/irobot/] had faced falling revenue [https://www.therobotreport.com/irobot-revenue-drops-again-with-no-sources-of-additional-capital/], diversification challenges [https://www.therobotreport.com/looking-back-irobot-scrapped-retired-robots-through-years/], and antitrust concerns that doomed [https://www.therobotreport.com/irobot-terminates-deal-with-amazon-laying-off-31-of-staff/] its proposed acquisition by Amazon. However, it remained committed to continuing to produce and support its fleet of millions of robotic vacuum cleaners. “It has been a privilege to lead iRobot through this pivotal period, and I’m incredibly proud of the team’s resilience, focus, and commitment to our customers,” stated Gary Cohen, CEO of iRobot. “Building on iRobot’s strong foundation, I look forward to working with the Picea leadership team as we enter our next chapter with renewed momentum.” “My conviction in iRobot has never been stronger, and together with Picea, we are focused on delivering reliable, high-quality products, supporting our customers, protecting consumer data, and operating with discipline as we move forward,” he added. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- IROBOT RESTRUCTURES, FORMS UNIT TO PROTECT U.S. DATA Three engineers in MIT’s Artificial Intelligence Lab founded iRobot in 1990. Since introducing [https://www.therobotreport.com/a-look-at-irobot-35-year-robotics-journey/] its first Roomba robot vacuum in 2002, the company said it has sold more than 50 million devices to date. iRobot has also added features for cleaning, mapping, and navigation to its portfolio, which it plans to continue developing. In 2022, iRobot’s plan to map homes with its vacuums sparked criticism [https://www.therobotreport.com/irobot-addresses-privacy-concerns-pending-amazon-deal/] from privacy advocates. However co-founder and then-CEO Colin Angle said at the time that “iRobot does not – and will not – sell customers’ personal information. Our customers control the personal information they provide us, and we use that information to improve robot performance and the customer’s ability to directly control a mission.” As part of its restructuring plan, iRobot said it has implemented “structural, legal, and governance safeguards to protect U.S. and other global consumer data and connected devices.” They include the creation of iRobot Safe Corp., a U.S.-based subsidiary responsible for the protection of U.S. consumer data. iRobot Safe and the controls are intended to maintain a clear separation between iRobot’s Chinese [https://www.therobotreport.com/tag/china/] ownership and its U.S. and other global consumer data. iRobot Safe will be governed by an independent board composed of U.S. citizens and will include an independent U.S.-based data security officer and an iRobot Safe CEO, each subject to strict eligibility requirements. The company said these safeguards should give regulators, consumers, and partners confidence that its data governance framework to protect consumer data remains transparent, enforceable, and effective following the transaction. Some of iRobot’s founders and other industry experts had expressed concerns [https://www.therobotreport.com/robotics-industry-reacts-to-irobot-bankruptcy/] about potential Chinese ownership of a leading provider of robots to U.S. households. PICEA PROVIDES BUSINESS, CONSUMER CONTINUITY Picea, which has research and development and manufacturing facilities in China and Vietnam, said it holds more than 1,300 intellectual property rights worldwide. The company [https://www.piceacorp.com/] noted that it has manufactured, sold, and serviced over 20 million robotic vacuum cleaners [https://www.therobotreport.com/tag/cleaning]. Picea also said it has more than 7,000 employees and relationships with leading global enterprises. As a longtime contract manufacturer and contract lender for iRobot, Picea provided liquidity and operational support during the restructuring process. It said it helped [https://www.therobotreport.com/this-time-irobot-needs-help-cleaning-up-a-mess/] ensure continuity for customers, employees, suppliers, and global partners. Following the transaction, iRobot is now a privately held company wholly owned by Picea. iRobot will continue to be based in Bedford, Mass., with engineering, product development, marketing, and other corporate functions across the U.S. iRobot said it will advance its long-term innovation strategy, “focused on delivering trusted robotics and smart home devices, enhancing customer experiences, and investing in future product development.” The company did not specify whether it will move beyond floor-cleaning robots or if it would rehire any of the staffers laid off [https://www.therobotreport.com/irobot-terminates-deal-with-amazon-laying-off-31-of-staff/] in recent years. The post iRobot emerges from Chapter 11 as restructured Picea U.S. subsidiary [https://www.therobotreport.com/irobot-emerges-from-chapter-11-picea-u-s-subsidiary/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "iRobot has restructured after its bankruptcy proceedings and purchase by Chinese manufacturer Picea, adding a data security unit in the U.S.\nThe post iRobot emerges from Chapter 11 as restructured Pic"
      },
      {
        "title": "Zipline raises over $600M in funding, surpasses 2M commercial drone deliveries",
        "link": "https://www.therobotreport.com/zipline-raises-over-600m-in-funding-surpasses-2m-commercial-drone-deliveries/",
        "pubDate": "2026-01-22T20:59:03.000Z",
        "content": "A Zipline drone making a delivery. [https://www.therobotreport.com/wp-content/uploads/2026/01/ziplinedelivery-featured.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/ziplinedelivery-featured.jpg Zipline said it beat its Q3 daily delivery volume target by about 30% and hit its Q4 target six weeks early. | Source: Zipline Zipline International Inc. this week announced it has surpassed 2 million commercial deliveries and raised more than $600 million. The company is also expanding operations to Houston and Phoenix in early 2026, followed by more metropolitan areas later in the year. The latest round of funding brings Zipline’s valuation to $7.6 billion. The milestone comes as the company [https://www.therobotreport.com/tag/zipline/] continues to grow across the U.S., delivering food [https://www.therobotreport.com/tag/food], retail [https://www.therobotreport.com/tag/retail], and healthcare [https://www.therobotreport.com/category/markets-industries/biotechnology-medical-healthcare/] products directly to customers’ homes in minutes. “Autonomous logistics has been maturing for more than a decade, and the last year has made it unmistakably clear that when deliveries are faster, cleaner, safer, and cheaper, demand isn’t just high; it grows exponentially,” stated Keller Cliffton, co-founder and CEO of Zipline. “In 2026, autonomous logistics will become an everyday staple for people across several states in the U.S.,” he added. “That transformation starts with Houston and my hometown of Phoenix, which we’ll begin serving early this year, and then expand to even more places across the country throughout the year.” In Houston and Phoenix, eligible customers will soon be able to order tens of thousands of items through the Zipline app [https://apps.apple.com/us/app/zipline-drone-delivery/id6472111511], with deliveries arriving in as little as 10 minutes via the company’s drones. Zipline claimed that its U.S. deliveries [https://www.therobotreport.com/tag/delivery-robots/] have grown by approximately 15% week over week for the past seven months, making it one of the fastest-growing AI [https://www.therobotreport.com/category/design-development/ai-cognition/] and robotics companies in the world. “As new markets come online, autonomous on-demand delivery is quickly moving from early adoption to everyday infrastructure,” it said. “This latest expansion is yet another sign that autonomous on-demand drone delivery will soon be the norm in America.” ZIPLINE PLANS TO USE LATEST FUNDING TO EXPAND TO 4 NEW STATES Zipline’s latest funding round included participation from several existing and new investors, including Fidelity Management & Research Co., Baillie Gifford, Valor Equity Partners, and Tiger Global. The company said it plans to use the capital to accelerate its expansion into at least four new states this year. Houston and Phoenix are the first two markets on that journey. “In the next five to 10 years, deliveries made by autonomous aircraft will become standard. That revolution is going to be led by Zipline,” said Antonio Gracias, founder, chief investment officer, and CEO of Valor Equity Partners. “There’s no better team, company, and product positioned to lead the charge than Zipline.” To date, Zipline said its zero-emission aircraft have flown more than 125 million autonomous commercial miles, delivering more than 20 million items without a serious injury. The company said it designed its system for speed and reliability at scale. Zipline added that its median flight time is three minutes. Customers routinely cite saving time as a reason why drone [https://www.therobotreport.com/category/robots-platforms/uav-drones/] deliveries quickly becomes part of their daily lives. Since August, Zipline said it has launched its delivery service to new areas weekly, unlocking thousands of customers every time. Each additional site ramps up faster than the last, according to the company Zipline’s first location in Dallas [https://www.therobotreport.com/faa-allows-wing-and-zipline-to-do-bvlos-flights-over-dallas/] took 10 weeks to reach 100 deliveries per day, and new sites reached that same volume in just two days. DRONE DELIVERY TAKES OFF ACROSS THE U.S. Zipline isn’t the only company working to make drone deliveries a regular part of life. Earlier this year, Wing Aviation LLC and Walmart Inc. announced [https://www.therobotreport.com/wing-brings-drone-delivery-to-150-more-walmart-stores/] they will expand drone deliveries to 150 more Walmart stores over the next year. Walmart [https://www.therobotreport.com/tag/walmart/] and Wing [https://www.therobotreport.com/tag/wing/] plan to establish a network of over 270 drone delivery locations by 2027, stretching from Los Angeles to Miami. The new service will launch in major hubs including Los Angeles, St. Louis, Cincinnati, and Miami, with others to be announced later. Zipline is also working with Walmart. Last year, the company launched [https://corporate.walmart.com/news/2025/06/05/walmart-takes-flight-with-drone-delivery-expansion-to-5-new-cities-redefining-fast-flexible-retail] its first-ever P2 drone site at Walmart stores in Mesquite and Waxahachie, Texas, offering a delivery experience that’s quieter than the average delivery truck, it claimed. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- The post Zipline raises over $600M in funding, surpasses 2M commercial drone deliveries [https://www.therobotreport.com/zipline-raises-over-600m-in-funding-surpasses-2m-commercial-drone-deliveries/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "In Houston and Phoenix, eligible customers will soon be able to order tens of thousands of items through the Zipline app.\nThe post Zipline raises over $600M in funding, surpasses 2M commercial drone d"
      },
      {
        "title": "LivsMed completes Korean IPO to accelerate remote robotic surgery",
        "link": "https://www.therobotreport.com/livsmed-completes-korean-ipo-accelerate-remote-robotic-surgery/",
        "pubDate": "2026-01-22T20:31:53.000Z",
        "content": "LivsMed has partnered with Sovato on telesurgery. [https://www.therobotreport.com/wp-content/uploads/2026/01/LivsMed-Stark-surgical-robot-Sovato-Telesurgery-1-1.jpg] LivsMed has partnered with Sovato on telesurgery. Source: LivsMed LivsMed LLC last week said it has completed an initial public offering, or IPO, on Korea’s KOSDAQ market. It raised about ₩135.9 billion ($94 million U.S.) at ₩55,000 per share, bringing its market capitalization to ₩1.4 trillion, or approximately $1 billion, making it a medical technology “unicorn.” The company [https://livsmed.us/] said it will use the proceeds to build an integrated production base, fund research and development, and strengthen related management systems to support global growth across its product portfolio. “As we scale globally, we remain focused on making advanced surgical capability more accessible,” said Jung Joo Lee, Ph.D., founder and CEO of LivsMed. “An innovation cannot be called an innovation unless it can reach the masses.” LivsMed develops systems for minimally invasive procedures, and collaborates with physicians worldwide to improve patient outcomes and expand access to advanced surgical [https://www.therobotreport.com/tag/surgical] capabilities. The company is headquartered in Seoul and has a U.S. subsidiary in San Diego. ROADMAP INCLUDES ROBOTS FOR THE U.S., LAPAROSCOPIC INSTRUMENTS In July 2025, LivsMed demonstrated the capabilities of its STARK surgical robot in an early feasibility wet-lab study conducted with telesurgery [https://www.therobotreport.com/tag/teleoperation] platform provider Sovato [https://www.therobotreport.com/tag/sovato]. In the demo [https://www.massdevice.com/livsmed-unveils-surgical-robot-telesurgery-capabilities/], the surgeon console was located in Santa Barbara, Calif., while the robotic system was in Chicago, supporting long-distance connectivity. The STARK robot-assisted surgical system is not yet approved for use and is not for sale in the U.S. LivsMed also plans to expand its portfolio of products for minimally invasive surgery. Launched in 2018, ArtiSential [https://livsmed.us/products/] is a line of fully articulating handheld laparoscopic instruments designed to provide wrist-like dexterity. The company has expanded its platform with ArtiSeal, a 90-degree articulating vessel sealer that it said enables multi-angle access in confined anatomy. LIVSMED DRAWS GLOBAL INVESTMENT LivsMed said its IPO drew significant interest from major domestic pension funds and institutions, as well as large global financial institutions headquartered in New York and Boston. During institutional book building, the company reported demand of roughly 231-to-1, with overseas participation representing 8.2% of the institutional demand, including investors from the U.S., the Middle East, and Asia. On its market debut, LivsMed shares opened more than 10% above the offering price, which it said reflected positive initial market reception. Samsung Securities and Mirae Asset Securities served as joint lead underwriters. The dollar equivalents provided above used an exchange rate of ₩1,445 per $1 as of Dec. 24, 2025. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- The post LivsMed completes Korean IPO to accelerate remote robotic surgery [https://www.therobotreport.com/livsmed-completes-korean-ipo-accelerate-remote-robotic-surgery/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "LivsMed has become a South Korean unicorn as it develops surgical robots and laparoscopic instruments.\nThe post LivsMed completes Korean IPO to accelerate remote robotic surgery appeared first on The "
      },
      {
        "title": "Festo introduces AI-based predictive maintenance platform to improve automation uptime",
        "link": "https://www.therobotreport.com/festo-introduces-ai-based-predictive-maintenance-platform-improve-automation-uptime/",
        "pubDate": "2026-01-21T21:40:48.000Z",
        "content": "Automated conveyor systems in a warehouse. [https://www.therobotreport.com/wp-content/uploads/2026/01/Festo-AX-Motion-Insights-featured.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/Festo-AX-Motion-Insights-featured.jpg The AX Motion Insights platform integrates AI with maintenance workflows, enabling distribution and fulfillment operations to predict points of failure, plan interventions, and reduce unplanned downtime. | Source: Festo While automation promises a future where robots can do work around the clock, seven days a week, without tiring, downtime caused by unexpected issues still holds us back from that future. Festo this week introduced its new Festo AX Motion Insights platform, which it said can reduce unplanned downtime in robotics. The platform combines AI [https://www.therobotreport.com/category/design-development/ai-cognition/]-based predictive analytics with maintenance workflows, which Festo said can reduce unplanned downtime across conveyors, sortation systems, palletizers, gantries, and material-handling equipment. This latest platform works with Festo’s existing software lineup. Festo AX Motion Insights Electric [https://www.festo.com/us/en/app/festo-ax-motion-insights-electric.html??fwacid=7fc0284a254beda0] software monitors servo drives and electric axes. AX Motion Insights Pneumatic software provides condition monitoring for pneumatic cylinders. AX Data Access serves as the data layer that makes operational technology (OT) data available for information technology (IT) analysis and integration. Together, Festo said the platforms enable fulfillment centers to scale predictive maintenance capabilities as needs develop rather than committing to a single, monolithic software rollout. Festo said the platform provides flexible deployment options that support on-premises and cloud-based environments. This allows fulfillment and distribution centers to align predictive maintenance with existing IT and operational requirements while maintaining control over how and where data is collected and used. Festo is a global manufacturer of pneumatic and electromechanical systems, components, and controls for process and industrial automation. The company [https://www.therobotreport.com/tag/festo/] has subsidiaries in more than 60 countries, and a wide-ranging 36,000-product catalog. MOTION INSIGHTS LOOKS FOR PROBLEMS, THEN TAKES ACTION TO PREVENT THEM Motion Insights identifies where problems are likely to occur. Smartenance AX, Festo’s maintenance management software, is the link to action. Smartenance AX turns predictive insight into planned maintenance by directing crews to the most likely point of failure instead of reacting after a machine stops. It combines asset tracking, maintenance planning, and a digital machine logbook, allowing condition data from Motion Insights to trigger targeted maintenance tasks. In addition to Smartenance AX, Motion Insights can also be integrated with other maintenance management systems, allowing condition data to inform existing workflows where customers prefer to keep their current platforms. AX Motion Insights Pneumatic [https://www.festo.com/us/en/app/festo-ax-motion-insights-pneumatic.html?fwacid=21fddd0f8a5e1123] provides universal condition monitoring for pneumatic [https://www.therobotreport.com/category/pneumatics-hydraulics-2/] cylinders from all manufacturers without requiring additional sensors, hardware changes, or mechanical modifications. The software detects anomalies and performance drift in pneumatic motion [https://www.therobotreport.com/category/robot-components/motioncontrol/], identifying not only impending failures, but also underperformance that can lead to inconsistent handling, increased air consumption, and throughput loss. AX Data Access [https://www.festo.com/us/en/app/apps/function/ax-industrial-apps.html?fwacid=397c02d63888b502] connects automation systems to enterprise IT environments by making operational data available for analysis beyond the control layer. By bridging OT and IT, AX Data enables fulfillment centers to correlate motion performance, maintenance activity, and energy use with broader operational metrics. FESTO PLANS FOR SCALE AND EASY DEPLOYMENT AX Motion Insights software is scalable by design. Machine builders and system integrators purchase licenses only for the functions and assets they need, with the ability to expand coverage over time as automation requirements evolve. Machine builders and system integrators can incorporate AX motion insights software into their after-sales support contracts as a value-added service for their customers. AX Motion Insights Electric integrates directly with Festo CMMT multiprotocol servo [https://www.therobotreport.com/category/technologies/actuators-motors-servos/] drives and electric axes used throughout fulfillment center automation systems. Festo multiprotocol servo drives are compatible with the leading industrial communication protocols, allowing a single drive platform to operate across mixed PLC and network environments. This simplifies standardization, reduces hardware variation in inventory, and helps system integrators commission and support automation systems more efficiently, Festo claimed. The company plans to include support for additional brands of servo drives and axes. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- The post Festo introduces AI-based predictive maintenance platform to improve automation uptime [https://www.therobotreport.com/festo-introduces-ai-based-predictive-maintenance-platform-improve-automation-uptime/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "Festo said the platform provides flexible deployment options that support on-premises and cloud-based environments.\nThe post Festo introduces AI-based predictive maintenance platform to improve automa"
      },
      {
        "title": "Boston Dynamics releases Spot and Orbit 5.1 with new Spot Cam",
        "link": "https://www.therobotreport.com/boston-dynamics-releases-spot-and-orbit-5-1-with-new-spot-cam/",
        "pubDate": "2026-01-21T18:28:46.000Z",
        "content": "Boston Dynamics' Spot quadruped with the new Spot Cam 2. [https://www.therobotreport.com/wp-content/uploads/2026/01/spot-cam2-illuminated-featured.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/spot-cam2-illuminated-featured.jpg Boston Dynamics’ Spot quadruped with the new Spot Cam 2. | Source: Boston Dynamics Boston Dynamics Inc. yesterday released the 5.1 update to its Spot quadruped and Orbit, the company’s fleet management and data analysis software. Boston Dynamics said the latest update will help its customers accelerate deployments with new workflows, enterprise-level controls, and a refreshed data collection payload. The new update includes improvements to the AI [https://www.therobotreport.com/category/design-development/ai-cognition/] models that power Spot [https://bostondynamics.com/products/spot/] and Orbit [https://bostondynamics.com/products/orbit/]. Boston Dynamics said it has designed its products to continuously learn about customer facilities in order to improve over time. The company [https://www.therobotreport.com/tag/boston-dynamics/] said its Orbit AIVI (artificial intelligence visual inspection) cloud-based models will improve based on the most common and valuable inspections that Spot conducts. It will enables multiple, larger models that can update regularly without updating Orbit software, said Boston Dynamics. This means that new inspections [https://www.therobotreport.com/tag/inspection] can be added without disrupting existing workflows. Boston Dynamics said these enhancements will improve its existing models and add capabilities such as sigh glass and pallet detection. In addition, it is expanding AIVI to use images captured with Spot’s body and gripper cameras. This allows Spot customers with Spot Arm to use that additional reach to inspect dark or difficult-to-access areas. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- BOSTON DYNAMICS UNVEILS SPOT CAM 2 AND ACOUSTIC IMAGING The new Spot Cam 2 [https://bostondynamics.com/products/payload/spot-cam/] payload adds features to Spot Cam+IR with new features that add perception capabilities to the legged [https://www.therobotreport.com/tag/legged-robots/] robot’s optional acoustic imager. Boston Dynamics said its second-generation Spot Cam now has a 4K pan-tilt-zoom (PTZ) camera [https://www.therobotreport.com/category/technologies/cameras-imaging-vision/] with 25x optical zoom, an integrated radiometric thermal camera, and a 360 x 130º spherical camera. The on-board accessory bay is compatible with Sorama L642 or Fluke SV600 acoustic imager—bringing more flexibility for sensor [https://www.therobotreport.com/category/technologies/sensors-sensing/] pointing for acoustic inspections, said the company. The accessory bay will allow for future payload attachments and integrations. The new Spot Cam can be mounted either front or rear, and it is equipped with eight ultra-bright LED lights for illumination in dark environments. Boston Dynamics added that customers have been using acoustic [https://bostondynamics.com/solutions/inspection/acoustic/] imaging on Spot to monitor the performance of various critical equipment. Using the same payload, customers can look for change-detection alerts on audio captures. Spot equipped with the Fluke SV600 or Sorama L642 will capture beamformed acoustic data from mechanical equipment. That data can be used to develop a change-detection algorithm to flag anomalies from nominal state captures. Customers will be able to visualize these results over-time via a spectrogram, said the Waltham, Mass.-based company. With the new acoustic change detection feature, Boston Dynamics said it is giving users the ability to monitor those changes over time. SPOT CAN NOW OPEN DOORS, EVEN WITHOUT ITS ARM Boston Dynamics has expanded its robot behavior library from staircase and crosswalk actions to help take Spot missions even further. With Door Opening, Spot has even more access to a facility without the use of an arm, the company said. Depending on a site’s automatic door configuration, Spot can now use both motion-activated doors as well as access controlled ones. After on-site integration, users may enable Spot to pass through access-controlled doors by adding actions to missions. This feature has been deployed with 18 beta customers and has already opened 2,500 doors, Boston Dynamics said. UPDATED ROBOT CAN NOW TAKE ON SECURITY PATROLS In addition to monitoring critical equipment and facility compliance, Update 5.1 introduces security patrol as a new mission type. Boston Dynamics asserted that these missions offer visibility to customers during off hours or more security [https://www.therobotreport.com/category/markets-industries/defense-security/] coverage in sensitive areas of their operations. If Spot detects a person during these patrol missions, the robot will pause, activate AV lights, capture PTZ, panoramic, and thermal images, trigger an alert, and resume its mission path. The new mission behaviors allow Spot to autonomously pause, redirect, or end missions based on what it sees. Users can put up fiducials on mission paths that allow Spot to return to the dock or sit down and stay there indefinitely. Boston Dynamics also announced more features for Site View authoring—allowing users to create even more inspections directly from within Orbit. Users of Spot Cam and Spot Cam+IR will be able to author new inspection actions for PTZ, thermal, and gauge readings directly from the Site View window in Orbit. Staffers no longer need to walk around their facilities with Spot to record new inspection points. With the new Spot Cam 2, they can also author acoustic (leak and vibration) inspections from within Site View, said Boston Dynamics. Spot's AI detected an unexpected person on a security patrol. [https://www.therobotreport.com/wp-content/uploads/2026/01/unexpected-person-1536x960-1.png]https://www.therobotreport.com/wp-content/uploads/2026/01/unexpected-person-1536x960-1.png Spot’s AI detected an unexpected person on a security patrol. | Source: Boston Dynamics BOSTON DYNAMICS UNLOCKS MULTI-MODAL INSPECTION Customers using Spot equipped with Spot Cam 2, an acoustic payload, and a mechanical inspection license can now record a multi-modal mechanical inspection, explained Boston Dynamics. Inspections can specify an acoustic mechanical inspection, a thermal inspection, and a short video recording, all targeting the same location. This provides users with a single unified output of data in Orbit. In addition, the company introduced the ability to capture thermal panoramas. Spot Cam 2 can capture a series of thermal images and stitch them into a single inspection. The panoramas will appear as an overlay in Site View, providing an additional spectrum of information from Spot, it said. Boston Dynamics said that Update 5.1 gives customers access to seven built-in demo dances, no additional license needed. Every customer can access these sequences from a tablet with their upgrade. The company did note that operators should follow standard operating guidelines for Spot, running dances and “emotes” at a safe distance from people. Spot performing a multimodal inspection. [https://www.therobotreport.com/wp-content/uploads/2026/01/multimodal-inspection-copy-1536x731-1.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/multimodal-inspection-copy-1536x731-1.jpg Spot performs a multimodal inspection. | Source: Boston Dynamics PRODUCT VERSION OF ATLAS NOW AVAILABLE In its blog, Boston Dynamics announced the product version of its",
        "excerpt": "Boston Dynamics' updates include an upgraded AI model, enhanced door-opening capabilities, and more. It also announced the product version of Atlas.\nThe post Boston Dynamics releases Spot and Orbit 5."
      },
      {
        "title": "Microsoft Research reveals Rho-alpha vision-language-action model for robots",
        "link": "https://www.therobotreport.com/microsoft-research-reveals-rho-alpha-vision-language-action-model-for-robots/",
        "pubDate": "2026-01-21T14:46:39.000Z",
        "content": "A humanoid robot such as this is one platform that the Microsoft Rho-alpha model is intended to make more autonomous. [https://www.therobotreport.com/wp-content/uploads/2026/01/Microsoft_Rho-alpha.jpg] Rho-alpha is designed to help robots including humanoids become more autonomous. Source: Microsoft To be useful in more dynamic and less structured environments, robots need artificial intelligence trained on a variety of sensory inputs. Microsoft Corp. today announced Rho-alpha, or ρα, the first robotics model derived from its Phi series of vision-language models. Vision-language-action models (VLAs) enable physical AI [https://www.therobotreport.com/category/design-development/ai-cognition/] systems to perceive, reason, and act with increasing levels of autonomy, noted Microsoft. The new models built on Phi [https://azure.microsoft.com/en-us/products/phi/?msockid=2cc5f4526b166732274ce7816a3b66c8] are intended to make robots more adaptable and trustworthy, the company [https://www.therobotreport.com/tag/microsoft] said. “Rho-alpha translates natural language commands into control signals for robotic systems performing bimanual manipulation tasks,” wrote Ashley Llorens [https://www.microsoft.com/en-us/research/people/allorens/?msockid=394581ce06c567df2171946b073d6601], corporate vice president and managing director of the Microsoft Research Accelerator. “It can be described as a VLA+ model in that it expands the set of perceptual and learning modalities beyond those typically used by VLAs.” For perception, Rho-alpha adds tactile [https://www.therobotreport.com/category/design-development/haptics/] sensing, and Microsoft said it is working to include modalities such as force. For learning, the company claimed that Rho-alpha can continually improve with feedback provided by people. The video below demonstrates Rho-alpha interacting with the BusyBox, a physical interaction benchmark that Microsoft Research recently introduced, cued by natural language instructions. RHO-ALPHA USES SIMULATION, DEMONSTRATION, AND THE WEB Rho-alpha co-trains for tactile awareness on trajectories from physical demonstrations and simulated [https://www.therobotreport.com/category/software-simulation/] tasks, as well as web-scale visual question-answering data, said LLorens in a blog post. “We plan to use the same blueprint to continue extending the model to additional sensing modalities across a variety of real-world tasks,” he added. There a lack of scalable robotics training data, especially for tactile and other less-common sensing modalities, acknowledged Microsoft. With the open NVIDIA Isaac Sim [https://developer.nvidia.com/isaac/sim] framework, researchers [https://www.therobotreport.com/category/research-development/] can generate synthetic data in a multistage process based on reinforcement learning. “While generating training data by teleoperating robotic systems has become a standard practice, there are many settings where teleoperation is impractical or impossible,” said Abhishek Gupta, assistant professor at the University of Washington [https://www.therobotreport.com/tag/university-of-washington/]. “We are working with Microsoft Research to enrich pre-training datasets collected from physical robots with diverse synthetic demonstrations using a combination of simulation and reinforcement learning.” “Training foundation models that can reason and act requires overcoming the scarcity of diverse, real-world data,” observed Deepu Talla, vice president of robotics and edge AI at NVIDIA [https://www.therobotreport.com/tag/nvidia/]. “By leveraging NVIDIA Isaac Sim on Azure to generate physically accurate synthetic datasets, Microsoft Research is accelerating the development of versatile models like Rho-alpha that can master complex manipulation tasks.” HUMANS PROVIDE COURSE CORRECTION FOR MICROSOFT MODELS Even with expanded perception, robots can still make mistakes during operation, said Microsoft. It explained that corrective feedback from teleoperation devices such as a 3D mouse can help Rho-alpha continue learning. In the video below, Microsoft shows two UR5e cobot [https://www.therobotreport.com/category/robots-platforms/collaborative-robot/] arms with tactile sensors using Rho-alpha to insert a plug. The right arm has difficulty with the task and is aided by human guidance in real time. “Our team is working toward end-to-end optimizations of Rho-alpha’s training pipeline and training data corpus for performance and efficiency on bimanual manipulation tasks of interest to Microsoft and our partners,” said Llorens. “The model is currently under evaluation on dual-arm setups and humanoid robots. We will publish a technical description in the coming months.” Microsoft said it is looking to work with robotics manufacturers, integrators, and end users to see how technologies such as Rho-alpha and associated tooling can help them train, deploy, and continuously adapt cloud-hosted physical AI with their own data. The company invited interested stakeholders to join its Research Early Access Program [https://forms.office.com/pages/responsepage.aspx?id=v4j5cvGGr0GRqy180BHbR_oe6q893mZLsFcgjoh0ZH1UNUhTTURDTDU1RzRDREFHNFVCSTA0STQ4Vy4u&route=shorturl]. The post Microsoft Research reveals Rho-alpha vision-language-action model for robots [https://www.therobotreport.com/microsoft-research-reveals-rho-alpha-vision-language-action-model-for-robots/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "The Rho-alpha model incorporates sensor modalities such as tactile feedback and is trained with human guidance, says Microsoft.\nThe post Microsoft Research reveals Rho-alpha vision-language-action mod"
      },
      {
        "title": "Serve Robotics to acquire hospital logistics provider Diligent Robotics",
        "link": "https://www.therobotreport.com/serve-robotics-acquires-diligent-robotics/",
        "pubDate": "2026-01-20T21:44:36.000Z",
        "content": "On the left, Serve Robotics' delivery robot, and on the right, Diligent Robotics' Moxi. [https://www.therobotreport.com/wp-content/uploads/2026/01/diligent-serve-featured.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/diligent-serve-featured.jpg On the left, Serve Robotics’ delivery robot, and on the right, Diligent Robotics’ Moxi. | Source: Serve Robotics, Diligent Robotics Serve Robotics Inc., a developer of sidewalk delivery robots, today said it is acquiring Diligent Robotics Inc. for $29 million. Diligent is the company behind Moxi, a mobile robot that navigates hospitals to deliver medical supplies. The companies said acquisition will open up new opportunities. Redwood City, Calif.-based Serve [https://www.therobotreport.com/tag/serve-robotics/], which has deployed [https://www.therobotreport.com/serve-robotics-has-deployed-2000-delivery-robots-across-u-s/] more than 2,000 sidewalk delivery robots in the U.S., last year raised [https://www.therobotreport.com/serve-robotics-raises-86m-for-last-mile-delivery-expansion/] more than $100 million [https://www.therobotreport.com/serve-robotics-could-bring-in-up-to-100m-from-stock-sale/] and acquired the assets of Voysys [https://www.therobotreport.com/serve-robotics-acquires-assets-voysys-autonomous-delivery/] and Vayu Robotics [https://www.therobotreport.com/serve-robotics-acquires-vayu-robotics-to-enhance-delivery-robots/]. With the Diligent acquisition, Serve Robotics is making its first foray into indoor environments, mobile manipulation [https://www.therobotreport.com/tag/mobile-manipulation/], and the healthcare [https://www.therobotreport.com/category/markets-industries/biotechnology-medical-healthcare/] industry. Austin, Texas-based Diligent [https://www.therobotreport.com/tag/diligent-robotics/] currently currently operates its Moxi robots in more than 25 hospitals, where robots have completed [https://www.therobotreport.com/diligent-robotics-hits-1m-picks-with-moxi-robot-in-healthcare-settings/] over 1.25 million tasks. “This is a case of prepared mind meets opportunity,” said Ali Kashani [https://www.therobotreport.com/ali-kashani-on-the-future-of-last-mile-logistics/], co-founder and CEO of Serve Robotics. “We’ve known about [Diligent].” “There’s a lot we like about Diligent and the team,” he told The Robot Report [https://www.therobotreport.com/]. “They’re one of the few robotics companies that have actually been out in the field with a real skilled fleet. That’s something that’s very much a match to our DNA. From the beginning, we try to go out and learn in the real world and build robots that are commercially out there at some scale.” ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- DILIGENT OPENS THE DOOR FOR MOBILE MANIPULATION One of the biggest differences between Moxi [https://www.diligentrobots.com/moxi], Diligent’s robot, and Serve’s robots is Moxi’s arm, which enables it to manipulate and affect the world around it. Moxi can open doors, interact with elevators, and more. The mobile robot [https://www.therobotreport.com/category/robots-platforms/amrs/] also has extensive experience operating in very crowded indoor environments, which is new for Serve. “In robotics, in general, you do have those two problem sets to solve: the navigation and manipulation,” Kashani said. “Bringing this together makes a lot of sense because directionally, we want to reach indoors, and we want to reach applications that require some degree of manipulation.” “I see this as almost an evolution,” he added. “We’ve always imagined humanoids [https://www.therobotreport.com/category/robots-platforms/humanoids/] as what the future is. It’s really nice to see so much investment and excitement in that field, but we’ve always liked to get there through commercial applications and do things that actually make money and learn from being in the real world.” Meanwhile, Serve’s experience in outdoor robotics could make Moxi even more flexible. “We’ve definitely heard, and we’ve talked to some hospitals, that being able to leave a facility and go outside can be really valuable,” Kashani said. SERVE ROBOTICS TO ‘SUPERCHARGE’ DILIGENT’S DEPLOYMENTS Serve Robotics said it has spent the past year rapidly expanding the number of robots it has operating in the world doing real work. With this experience, Kashani said he hopes to use Serve’s scaling and manufacturing capabilities to help Diligent Robotics to do the same. “A year ago, we had deployed 100 robots, and we scaled to 2,000,” Kashani said. “[Diligent] is at about 100 robots right now. So, a lot of what we have created — infrastructure, systems, processes, and, of course, autonomy and AI and models — all that stuff can be useful. Ultimately, what we want is to supercharge Diligent and their team.” Andrea Thomaz, co-founder and the current CEO of Diligent, will continue leading the company moving forward. Kashani said its team members will now have “more power behind them.” For Serve, the acquisition is part of its roadmap to bring its platform to many different industries and environments. “We have one of the largest autonomous fleets in the world right now, and we are learning so much from that. We are getting data from it that helps us with developing our models,” Kashani said. “All of that is what ultimately enables us to make Diligent and other folks that want to use our platforms to succeed.” “Expanding the operating domain from just outdoors to now also indoors gives access to some unique data to teach robots how to navigate new environments,” he continued. “Our AI models already are doing a really fantastic job in cities. Hopefully, that enables the Moxi robots to operate even better.” Serve Robotics said it expects the deal to close in the first quarter of 2026. The company could also pay an additional $5.3 million to Diligent shareholders upon the achievement of specified milestones. The post Serve Robotics to acquire hospital logistics provider Diligent Robotics [https://www.therobotreport.com/serve-robotics-acquires-diligent-robotics/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "Serve Robotics said it hopes to help Diligent Robotics scale deployments of its hospital delivery robot Moxi. \nThe post Serve Robotics to acquire hospital logistics provider Diligent Robotics appeared"
      },
      {
        "title": "Konnex raises funding to advance robotics-as-a-service offering",
        "link": "https://www.therobotreport.com/konnex-raises-funding-advance-robotics-as-a-service-offering/",
        "pubDate": "2026-01-20T19:42:29.000Z",
        "content": "Konnex is building a marketplace and protocol for robots and AI to be contracted for physical work. [https://www.therobotreport.com/wp-content/uploads/2026/01/Konnex_02.jpg] Konnex is building a marketplace and protocol for robots and AI to be contracted for physical work. Source: Konnex Konnex last week said it has raised $15 million in funding from a consortium of strategic partners. The startup said the investment will accelerate its efforts to transition autonomous robots from closed, proprietary systems into an app-like ecosystem. “Physical work is a $25 trillion economy currently trapped in closed systems,” said Jon Ollwerther, CEO of Konnex. “With the support of our partners, Konnex is building the key to unlock that value. We are creating a world where autonomous robots work like apps—contracted, verified, and paid—to provide the scalable labor the world desperately needs.” The company is based in the British Virgin Islands and has staff in the U.S. KONNEX WORKS TO OVERCOME SILOED AUTOMATION Despite a spate of major recent innovations around robotics and AI [https://www.therobotreport.com/category/design-development/ai-cognition/], work remains trapped in siloed infrastructures, according to Konnex. It is introducing a framework where autonomous robots function like applications: easily and quickly contracted, verified, and paid. The company said its marketplace and protocol will verify task outcomes with onchain and settle payments in stablecoins. Konnex claimed that its robotics-as-a-service (RaaS [https://www.automatedwarehouseonline.com/category/raas/]) evolution ensures labor can be deployed and scaled with the same fluidity as software. “Konnex is redefining the future of work by bridging the gap between autonomous robotics and the global economy,” said the company [https://konnex.world/]. “By treating autonomous labor as a verifiable, liquid asset, Konnex enables industries to deploy robotic solutions with unprecedented ease and transparency. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- INDUSTRY VETERANS LEAD COMPANY Konnex said it is led by a team of veterans whose experience spans the robotics, drone [https://www.therobotreport.com/category/robots-platforms/uav-drones/] technology, and capital markets sectors, including: * Jon Ollwerther, CEO: A “40 Under 40” honoree with more than 15 years of experience in robotics and media. Ollwerther previously led commercial teams at Measure and Aerobo, and he sits on the Board of The Stan Lee Foundation. * Brandon Torres Declet, strategic supporter: A five-time CEO and founder; and executive in the drone, robotics, and defense sectors, currently serving as CEO of Exyn Technologies [https://www.therobotreport.com/tag/exyn-technologies/] and co-founder of ReadyMonitor. Declet has successfully led companies such as AgEagle Aerial Systems, where he raised over $100 million and drove key acquisitions, and Measure, which became North America’s largest drone service provider under his leadership. * Lucas Van Oostrum, strategic advisor: A drone-swarm pioneer and multi-robot coordination expert. Van Oostrum co-founded Nova Sky Stories with Kimbal Musk and co-launched the €100 million ($117.2 million U.S.) RoboValley Fund. In addition, Konnex said its funding included backing from venture firms including Cogitent Ventures, Liquid Capital, Leland Ventures, Covey, LD Capital, M77 Ventures, and Block Maven LLC. The startup said it plans to use the new capital to expand the Konnex platform, integrate with new hardware partners, and further develop the verification protocols that allow autonomous systems to operate safely and efficiently in the real world. The post Konnex raises funding to advance robotics-as-a-service offering [https://www.therobotreport.com/konnex-raises-funding-advance-robotics-as-a-service-offering/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "Konnex has raised funding to offer robotics and AI that it says can be deployed and scaled as decentralized labor like software as a service.\nThe post Konnex raises funding to advance robotics-as-a-se"
      },
      {
        "title": "Meet MassRobotics’ 5th Healthcare Robotics Startup Catalyst cohort",
        "link": "https://www.therobotreport.com/meet-massrobotics-5th-healthcare-robotics-startup-catalyst-cohort/",
        "pubDate": "2026-01-20T18:59:19.000Z",
        "content": "MassRobotics Healthcare Robotics Startup Catalyst member Andromeda at the Robotics Summit 2025. [https://www.therobotreport.com/wp-content/uploads/2026/01/enchantedmachinesatroboticssummit-featured.jpg]https://www.therobotreport.com/wp-content/uploads/2026/01/enchantedmachinesatroboticssummit-featured.jpg Andromeda creates robot companions for aged care and assisted living environments. The MassRobotics Healthcare Robotics Startup Catalyst cohort member showed its system at the 2025 Robotics Summit & Expo. Source: WTWH Media MassRobotics has announced the 11 companies in its 2026 Healthcare Robotics Startup Catalyst. Now in its fifth cohort, the program empowers global startups to accelerate the development and commercialization of robotic technologies that improve clinical care, hospital operations, and laboratory automation. The selected companies will participate in a five-month mentorship program running from January to May 2026. The curriculum connects founders with senior-level experts [https://www.massrobotics.org/healthcare-catalyst-mentors/] from the organizing corporate partners, the program’s Medical Advisory Board, and the broader robotics and medical ecosystem. “The Healthcare Robotics Startup Catalyst was created to bridge the gap between technological possibility and clinical reality,” said Juan Necochea, strategic partnerships director at MassRobotics. “This year’s cohort represents a diverse range of solutions, from AI [https://www.therobotreport.com/category/design-development/ai-cognition/]-guided dentistry to pharmacy automation. By connecting these founders with our corporate collaborators and medical experts, we aim to shorten their path to market and ultimately improve patient outcomes.” The 2026 Healthcare Robotics Startup Catalyst program features a hybrid structure designed to support startups regardless of their global location. Key milestones include: * Healthcare in Robotics Week: A week of in-person events from March 16 to 20, 2026, at MassRobotics headquarters in Boston. It includes the organization [https://www.therobotreport.com/tag/massrobotics/]‘s signature series events, connecting industry challenges and startup solutions, mentoring sessions, and an investor open house. * Robotics Summit & Expo [https://www.roboticssummit.com/]: The program culminates with a showcase on May 27 and 28 in Boston. At the show, the cohort will exhibit their systems on the show floor and lead a session on robotics innovation in healthcare [https://www.therobotreport.com/category/markets-industries/biotechnology-medical-healthcare/]. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- HEALTHCARE ROBOTICS STARTUP CATALYST COHORT HAS 11 MEMBERS MassRobotics listed the companies that make up the fifth Healthcare Robotics Startup Catalyst cohort. * Concerto Biosciences is the pioneer [https://www.concertobio.com/] of the “kChip,” a laboratory automation platform that constructs and measures millions of microbial combinations to map the microbial world and develop science-first human health products. * Enchanted Tools is the company [https://www.therobotreport.com/tag/enchanted-tools/] behind the Mirokaï character-based robots (see video below). It designed thm to deliver everyday on-site assistance in care settings. The robots can guide and reassure patients and residents while autonomously handling simple logistics to support care teams. * Hesy Tech has developed an AI-guided robotic platform for preventive dentistry that automates routine hygiene tasks, allowing clinics to increase capacity and consistency under human oversight. * Humotech powers [https://humotech.com/] data-driven, precision care by helping clinicians rapidly compare prosthetic foot options for people with lower limb amputation (see video below). It is a 2025 RBR50 Robotics Innovation Award [https://www.therobotreport.com/rbr50-2025/] winner. * HyperSpectralCorp merges [https://www.hyperspectral.ai/] hyperspectral imaging and Raman spectroscopy with an autonomous AI scientist to enable rapid, automated pathogen detection and experimentation for healthcare and bioprocessing. * Inception Robotics develops [https://www.inceptionrobotics.ai/medsort.html] robots for mundane pharmacy tasks. Its MedSort [https://www.inceptionrobotics.ai/medsort.html] autonomously sorts returned medicines to save pharmacy technician time, reduce burnout, and medication waste. * Lupa Robotics is building a mass-scale, transferable human dexterity dataset with glove-captured vision, touch, and motion, to pioneer a robot-hand foundation model that delivers capable hands to the real world. * Ras Labs created [https://raslabs.com/] the Tactile Fingertip and Synthetic Muscle technologies, which provide robots with a humanlike sense of touch, enhancing dexterity for grippers, humanoids, and prosthetics. * Revolve Surgical develops [https://www.revolvesurgical.com/] zero-footprint surgical robotics and AI platform designed to bring accessible, scalable robotic surgery to every operating room, from academic hospitals to rural outpatient centers. * Whelix builds [https://www.whelix.co/] intelligent, modular robotic systems for wet-lab automation, specifically targeting the manual bottlenecks of cell culture to accelerate life science research. * Zeus Robotics offers [https://www.zeusrobotics.ai/] ZERA, a physical-AI autonomous robot that automates in-hospital logistics without fixed infrastructure, enabling facilities to reduce costs and operate efficiently amid labor shortages. THE 2026 SESSION INCLUDES COMPREHENSIVE SUPPORT A unique feature of the 2026 Healthcare Robotics Startup Catalyst program is the comprehensive ecosystem of support provided by an expanded Medical Advisory Board and a specialized network of industry experts. The board is composed of practicing clinicians and healthcare executives. It provides critical validation on clinical relevance. This ensures that the robots developed will integrate into existing hospital workflows while adhering to rigorous patient safety and ethical standards, said MassRobotics. Complementing this clinical perspective, the program’s network of industry experts will provide mentorship in operational scaling, manufacturing, and regulatory compliance. Through sessions and targeted workshops, the cohort will gain direct access to guidance on fundraising, FDA approval processes, cybersecurity requirements, and intellectual property strategy. MassRobotics said this bridges the gap between engineering prototypes and commercially viable medical products. The nonprofit [https://www.massrobotics.org/] said it is the largest independent robotics hub dedicated to accelerating innovation, commercialization, and adoption. Its stated mission is to help create and scale the next generation of successful robotics and AI technology companies. MassRobotics added that it provides entrepreneurs and startups with the workspace, resources, programming, and connections they need to develop, prototype, test, and commercialize their products and solutions. The post Meet MassRobotics’ 5th Healthcare Robotics Startup Catalyst cohort [https://www.therobotreport.com/meet-massrobotics-5th-healthcare-robotics-startup-catalyst-cohort/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "The MassRobotics Healthcare Robotics Startup Catalyst Program supports startups regardless of their location.\nThe post Meet MassRobotics’ 5th Healthcare Robotics Startup Catalyst cohort appeared first"
      },
      {
        "title": "Spencer Krause: Why hardware is the new engineering frontier",
        "link": "https://www.therobotreport.com/spencer-krause-why-hardware-is-the-new-engineering-frontier/",
        "pubDate": "2026-01-19T17:39:44.000Z",
        "content": "The Robot Report Podcast [https://soundcloud.com/robot-report-podcast] · Spencer Krause: Why Hardware is the New Engineering Frontier [https://soundcloud.com/robot-report-podcast/spencer-krause-why-hardware-is-the-new-engineering-frontier] In Episode 227 of The Robot Report Podcast, hosts Steve Crowe and Mike Oitzman recap the major robotics news of the week. Our guest on the show this week is Spencer Krause, co-founder and CEO of SKA Robotics [https://www.therobotreport.com/tag/ska-robotics/]. A longtime friend of the show, he shares insights into the development process for new robotic systems and takes a deep dive into ruggedized field robotics. headshot of spencer krause. [https://www.therobotreport.com/wp-content/uploads/2026/01/SpencerKrause-sm-headshot.jpg] Spencer Krause, co-founder and CEO of SKA Robotics. From automating giant mining trucks to launching “software-defined” actuators, Krause discusses the “mercenary” engineering mindset, including war stories from the field, and why hardware is the next frontier in the post-AI era. Krause has been engineering and building robots for more than 23 years. SKA Robotics has served multiple Fortune 100 companies developing advanced field robots. Spencer said he recently co-founded Tension Dynamics [https://tensiondynamics.com/] because he recognized an opportunity to revolutionize the market for linear actuators and motion platforms. In addition, Krause hosts the podcast “Collaborative With Spencer Krause [https://www.youtube.com/@CWSK],” where he has informal conversations with people doing interesting things in technology, research, and entrepreneurship. ---------------------------------------- SHOW TIMELINE * 9:12 – News of the week * 26:47 – Spencer Krause, co-founder and CEO of SKA Robotics [https://skarobotics.com/] and co-founder of Tension Dynamics ---------------------------------------- NEWS OF THE WEEK SKILD AI RAISES $1.4B TO BUILD ‘OMNI-BODIED’ ROBOT BRAIN [https://www.therobotreport.com/skild-ai-raises-1-4b-building-omni-bodied-robot-skild-brain/] Skild AI has reached a $14 billion valuation after a $1.4 billion funding round led by SoftBank Group, with participation from NVIDIA, Jeff Bezos, and strategic partners such as Samsung and LG. Founded in 2023, the company is developing the Skild Brain, a foundation model designed for multiple robot body types. Unlike AI systems requiring programming for specific hardware, this model controls systems including humanoids, quadrupeds, and mechanical arms—without prior knowledge of the machine’s form. To develop this system, Skild AI trains its model using human action videos and physics simulations. The technology uses in-context learning to allow robots to adapt to physical changes. While the company intends to deploy these systems in homes for tasks like cooking and cleaning, its current focus is on enterprise applications in security, manufacturing, warehouse logistics, and construction. ROBOTAXI SERVICES EXPAND TO LONDON London is set to become [https://www.bbc.com/news/articles/cy8jmx1dl9ro] one of the first major cities where the world’s leading autonomous vehicle [https://www.therobotreport.com/category/robots-platforms/self-driving-vehicles/] companies — especially from the U.S. and China — directly compete by launching robotaxi services as early as 2026. Waymo [https://www.therobotreport.com/tag/waymo/] has begun testing [https://www.therobotreport.com/waymo-plans-to-bring-driverless-robotaxis-london-2026/] its self-driving vehicles in London and plans a commercial launch there. Baidu [https://www.therobotreport.com/tag/baidu/]’s Apollo Go is preparing to bring its robotaxis [https://www.therobotreport.com/tag/robotaxis] to London through partnerships with companies like Uber and Lyft [https://www.therobotreport.com/lyft-baidu-partner-deploy-autonomous-vehicles-europe/]. The Chinese autonomous ride-hailing service operator is already operating at scale in Asia. ---------------------------------------- SITE AD for the 2026 Robotics Summit save the date. [https://www.therobotreport.com/wp-content/uploads/2026/01/Early-Bird-Promo-Inline-Ad-RSE-2.png]https://www.roboticssummit.com/ ---------------------------------------- The post Spencer Krause: Why hardware is the new engineering frontier [https://www.therobotreport.com/spencer-krause-why-hardware-is-the-new-engineering-frontier/] appeared first on The Robot Report [https://www.therobotreport.com].",
        "excerpt": "The podcast guest this week is Spencer Krause, co-founder and CEO of SKA Robotics and co-founder of Tension Dynamics.\nThe post Spencer Krause: Why hardware is the new engineering frontier appeared fir"
      },
      {
        "title": "Chinese robotics outlook for 2026 includes cobot growth, competitive pressure",
        "link": "https://www.therobotreport.com/chinese-robotics-outlook-2026-includes-growth-competitive-pressure/",
        "pubDate": "2026-01-19T13:23:40.000Z",
        "content": "Specs of the Unitree H2 humanoid robot. [https://www.therobotreport.com/wp-content/uploads/2025/10/Unitree_H2.jpg] Specs of the Unitree H2 humanoid robot, one of several being developed in China. Source: Unitree Based on our data, Chinese industrial robot sales again in 2025 by roughly 10%. With other major markets comparatively weaker, China further cemented its top position in global robot sales. For 2026, we are cautiously optimistic and expect mid- to high-single-digit growth. Sales of collaborative robots [https://www.therobotreport.com/category/robots-platforms/collaborative-robot/] in China have outpaced the broader market over the past two years — and there are strong indications that this trend will continue. Key drivers include easier installation, high flexibility, relatively low energy consumption, and new applications, particularly in electric-vehicle manufacturing. Intense price pressure — and the consolidation that comes with it — will persist. At the same time, we see both industrial [https://www.therobotreport.com/category/robots-platforms/industrial-robots/] robots and cobots [https://www.therobotreport.com/tag/cobot/] trending toward more “intelligent” solutions as a means of differentiation, such as semi-autonomous welding [https://www.therobotreport.com/tag/welding/]. After China [https://www.therobotreport.com/category/china/]’s industrial robot exports grew by an average of about 65% per year from 2022 to 2024, that momentum continued in 2025. While full-year 2025 figures are not yet available, export levels had already surpassed the prior year’s total by the end of the third quarter. We expect this trajectory to continue into 2026. MORE CHINESE CAPITAL FLOWS INTO EMBODIED AI China is moving alongside to the U.S. the forefront of development in physical AI [https://www.therobotreport.com/category/design-development/ai-cognition/]. By our estimates, investment in early-stage robotics companies in both the U.S. and China in 2025 was roughly five to six times higher than in Europe. In China alone, we see at least five embodied AI companies that have each raised more than $210 million to date, and capital continues to flow aggressively into the space: On Jan. 12, X Square announced [https://www.therobotreport.com/x-square-robot-secures-140m-in-funding-for-ai-foundation-models/] it had raised RMB 1 billion (about $140 million) in an A++ round led by ByteDance and HongShan Capital (formerly Sequoia China). Meituan and Alibaba had participated in earlier rounds. In just two years, X Square [https://www.therobotreport.com/tag/x-square-robot/] has raised more than $400 million. X Square is pursuing what founder Wang Qian calls “an independent foundation model for embodied AI.” The core thesis: AI designed for the physical world requires different architectures than language models. According to [https://www.therobotreport.com/x-square-robot-debuts-foundation-model-embodied-ai-100m-series-a/] the company, its WALL‑A system not only processes visual inputs, but it can also “understand” causal physical relationships — enabling robots, for example, to infer hidden objects and autonomously correct errors without human intervention. Many in the West have primarily been watching U.S. efforts such as Open‑X‑Embodiment, NVIDIA [https://www.therobotreport.com/tag/nvidia/] GR00T, or Amazon [https://www.therobotreport.com/tag/amazon] Vulcan. However, China is increasingly producing approaches that are equivalent — and in some cases complementary — along the same trajectory toward “physical intelligence.” The differentiator is less about a fundamentally different stack, and more about the consistent combination of large-scale embodiment datasets, end-to-end vision-language-action (VLA) models, and the systematic coupling of high-level planning with robust, contact-rich execution. These are precisely the building blocks that separate a compelling demo from a reliable deployment. The Quanta robot, shown here, is intended to provide a path to humanoids in the household, says Chinese company X Square Robot. [https://www.therobotreport.com/wp-content/uploads/2025/09/Quanta_Robot.jpg] The Quanta robot is intended to provide a path to humanoids in the household. Source: X Square Robot TECHNOLOGY IS LEAVING THE LAB — PILOTS MUST DELIVER ECONOMIC VALUE For humanoid [https://www.therobotreport.com/category/robots-platforms/humanoids/] robots and physical AI in China, we expect a shift in 2026 away from headline-grabbing spectacles and toward real applications with commercial value. Investors are demanding it. The anticipated IPO of Unitree [https://www.therobotreport.com/tag/unitree] in 2026 could become one of the larger Chinese robotics tech listings in some time, with more likely to follow. At the same time, consolidation will accelerate as weaker players fall away. While U.S. companies such as Physical Intelligence [https://www.therobotreport.com/tag/physical-intelligence], Skild.ai [https://www.therobotreport.com/tag/skild-ai/], and Google [https://www.therobotreport.com/tag/google] Gemini Robotics [https://www.therobotreport.com/?s=google%20gemini%20robotics&page=1] still lead on generalization, Chinese providers like X Square, TARS, AgiBot [https://www.therobotreport.com/tag/agibot/], Galaxea, and Galbot [https://www.therobotreport.com/tag/galbot/] could benefit from offering full-stack systems built around clearly defined tasks. This enables faster iteration cycles, higher reliability, and better cost/performance — because every component is optimized as part of a tightly integrated system. HIGH-QUALITY, REAL-WORLD DATA IS FUEL Chinese companies are also leaning harder into real-world operational data to improve their models. On Dec. 30, 2025, the startup TARS Robotics — founded about 11 months earlier — released [https://wiyh.tars-ai.com/] its open “World in Your Hands” dataset. Similar to the autonomous driving playbook, the company argues that high-quality, human-centric data is the critical fuel for physical AI. According to TARS, its data collection approach can generate up to 1.8 TB per operator, per day of high-precision 6D motion data. The company says this helped raise robot success rates on complex manipulation tasks in unstructured environments from about 8% to about 60%. Biggest Chinese startups in embodied intelligence. [https://www.therobotreport.com/wp-content/uploads/2026/01/chinese_startups.png] Chinese robotics startups have raised significant funding in the past few years. Source: STM Stieler OPENNESS AND NETWORK EFFECTS AS A CHINESE PLATFORM STRATEGY On Jan. 4, Galaxea Dynamics [https://galaxea-dynamics.com/] introduced its G0 Plus with an out-of-the-box VLA model. The company now ships its mobile dual-arm robots with a pre-installed, openly available VLA. In the “Pick Up Anything” demo, it showed a full pipeline — understanding natural language, planning actions, and executing in the real world — including zero-shot capability. The system was trained on the Galaxea Open-world Dataset (GOD), which includes real-world data from classic grasping tasks as well as more complex interactions. The company said its plug-and-play approach enables developers to get the system running in under 30 minutes and then fine-tune it for new tasks. This strategic positioning could help Galaxea build a platform role in AI-enabled robot control over the medium to long term. HYBRID FORM FACTORS MATTER MORE FOR ROI CALCULATIONS Intralogistics [https://www.automatedwarehouseonline.com/tag/intralogistics/] use cases — alongside simple assembly [https://www.therobotreport.com/tag/assembly] and inspection [https://www.therobotreport.com/tag/inspection] tasks — are among the first applications that Chinese makers of humanoids aim to commercialize in 2026. Notably, the Chinese companies with the strongest AI models for two-arm manipulation tend to be pragmatic about",
        "excerpt": "Chinese trends in industrial robots and cobots for 2026 include growing volumes, consolidation pressures, and international expansion.\nThe post Chinese robotics outlook for 2026 includes cobot growth,"
      }
    ],
    "arxiv": [
      {
        "id": "2601.16638",
        "title": "A Unified Calibration Framework for High-Accuracy Articulated Robot Kinematics",
        "authors": [
          "Philip Tobuschat",
          "Simon Duenser",
          "Markus Bambach",
          "Ivo Aschwanden"
        ],
        "abstract": "Title:\n          A Unified Calibration Framework for High-Accuracy Articulated Robot Kinematics\n        \n          Researchers have identified various sources of tool positioning errors for articulated industrial robots and have proposed dedicated compensation strategies. However, these typically require individual, specialized experiments with separate models and identification procedures. This article presents a unified approach to the static calibration of industrial robots that identifies a robot model, including geometric and non-geometric effects (compliant bending, thermal deformation, gear transmission errors), using only a single, straightforward experiment for data collection. The model augments the kinematic chain with virtual joints for each modeled effect and realizes the identification using Gauss-Newton optimization with analytic gradients. Fisher information spectra show that the estimation is well-conditioned and the parameterization near-minimal, whereas systematic temporal cross-validation and model ablations demonstrate robustness of the model identification. The resulting model is very accurate and its identification robust, achieving a mean position error of 26.8 $\\mu m$ on a KUKA KR30 industrial robot compared to 102.3 $\\mu m$ for purely geometric calibration.",
        "link": "https://arxiv.org/abs/2601.16638",
        "submittedDate": "2026-01-26T11:10:37.481Z"
      },
      {
        "id": "2601.16677",
        "title": "Sim-to-Real Transfer via a Style-Identified Cycle Consistent Generative Adversarial Network: Zero-Shot Deployment on Robotic Manipulators through Visual Domain Adaptation",
        "authors": [
          "Lucía Güitta-López",
          "Lionel Güitta-López",
          "Jaime Boal",
          "Álvaro Jesús López-López"
        ],
        "abstract": "Title:\n          Sim-to-Real Transfer via a Style-Identified Cycle Consistent Generative Adversarial Network: Zero-Shot Deployment on Robotic Manipulators through Visual Domain Adaptation\n        \n          The sample efficiency challenge in Deep Reinforcement Learning (DRL) compromises its industrial adoption due to the high cost and time demands of real-world training. Virtual environments offer a cost-effective alternative for training DRL agents, but the transfer of learned policies to real setups is hindered by the sim-to-real gap. Achieving zero-shot transfer, where agents perform directly in real environments without additional tuning, is particularly desirable for its efficiency and practical value. This work proposes a novel domain adaptation approach relying on a Style-Identified Cycle Consistent Generative Adversarial Network (StyleID-CycleGAN or SICGAN), an original Cycle Consistent Generative Adversarial Network (CycleGAN) based model. SICGAN translates raw virtual observations into real-synthetic images, creating a hybrid domain for training DRL agents that combines virtual dynamics with real-like visual inputs. Following virtual training, the agent can be directly deployed, bypassing the need for real-world training. The pipeline is validated with two distinct industrial robots in the approaching phase of a pick-and-place operation. In virtual environments agents achieve success rates of 90 to 100\\%, and real-world deployment confirms robust zero-shot transfer (i.e., without additional training in the physical environment) with accuracies above 95\\% for most workspace regions. We use augmented reality targets to improve the evaluation process efficiency, and experimentally demonstrate that the agent successfully generalizes to real objects of varying colors and shapes, including LEGO\\textsuperscript{\\textregistered}~cubes and a mug. These results establish the proposed pipeline as an efficient, scalable solution to the sim-to-real problem.",
        "link": "https://arxiv.org/abs/2601.16677",
        "submittedDate": "2026-01-26T11:10:37.482Z"
      },
      {
        "id": "2601.16686",
        "title": "Adaptive Reinforcement and Model Predictive Control Switching for Safe Human-Robot Cooperative Navigation",
        "authors": [
          "Ning Liu",
          "Sen Shen",
          "Zheng Li",
          "Matthew D'Souza",
          "Jen Jen Chung",
          "Thomas Braunl"
        ],
        "abstract": "Title:\n          Adaptive Reinforcement and Model Predictive Control Switching for Safe Human-Robot Cooperative Navigation\n        \n          This paper addresses the challenge of human-guided navigation for mobile collaborative robots under simultaneous proximity regulation and safety constraints. We introduce Adaptive Reinforcement and Model Predictive Control Switching (ARMS), a hybrid learning-control framework that integrates a reinforcement learning follower trained with Proximal Policy Optimization (PPO) and an analytical one-step Model Predictive Control (MPC) formulated as a quadratic program safety filter. To enable robust perception under partial observability and non-stationary human motion, ARMS employs a decoupled sensing architecture with a Long Short-Term Memory (LSTM) temporal encoder for the human-robot relative state and a spatial encoder for 360-degree LiDAR scans. The core contribution is a learned adaptive neural switcher that performs context-aware soft action fusion between the two controllers, favoring conservative, constraint-aware QP-based control in low-risk regions while progressively shifting control authority to the learned follower in highly cluttered or constrained scenarios where maneuverability is critical, and reverting to the follower action when the QP becomes infeasible. Extensive evaluations against Pure Pursuit, Dynamic Window Approach (DWA), and an RL-only baseline demonstrate that ARMS achieves an 82.5 percent success rate in highly cluttered environments, outperforming DWA and RL-only approaches by 7.1 percent and 3.1 percent, respectively, while reducing average computational latency by 33 percent to 5.2 milliseconds compared to a multi-step MPC baseline. Additional simulation transfer in Gazebo and initial real-world deployment results further indicate the practicality and robustness of ARMS for safe and efficient human-robot collaboration. Source code and a demonstration video are available at this https URL.",
        "link": "https://arxiv.org/abs/2601.16686",
        "submittedDate": "2026-01-26T11:10:37.482Z"
      },
      {
        "id": "2601.16691",
        "title": "Creating a biologically more accurate spider robot to study active vibration sensing",
        "authors": [
          "Siyuan Sun",
          "Eugene H. Lin",
          "Nathan Brown",
          "Hsin-Yi Hung",
          "Andrew Gordus",
          "Jochen Mueller",
          "Chen Li"
        ],
        "abstract": "Title:\n          Creating a biologically more accurate spider robot to study active vibration sensing\n        Comments:\n          8 pages, 12 figures\n        \n          Orb-weaving spiders detect prey on a web using vibration sensors at leg joints. They often dynamically crouch their legs during prey sensing, likely an active sensing strategy. However, how leg crouching enhances sensing is poorly understood, because measuring system vibrations in behaving animals is difficult. We use robophysical modeling to study this problem. Our previous spider robot had only four legs, simplified leg morphology, and a shallow crouching range of motion. Here, we developed a new spider robot, with eight legs, each with four joints that better approximated spider leg morphology. Leg exoskeletons were 3-D printed and joint stiffness was tuned using integrated silicone molding with variable materials and geometry. Tendon-driven actuation allowed a motor in the body to crouch all eight legs deeply as spiders do, while accelerometers at leg joints record leg vibrations. Experiments showed that our new spider robot reproduced key vibration features observed in the previous robot while improving biological accuracy. Our new robot provides a biologically more accurate robophysical model for studying how leg behaviors modulate vibration sensing on a web.",
        "link": "https://arxiv.org/abs/2601.16691",
        "submittedDate": "2026-01-26T11:10:37.482Z"
      },
      {
        "id": "2601.16866",
        "title": "Boosting Deep Reinforcement Learning with Semantic Knowledge for Robotic Manipulators",
        "authors": [
          "Lucía Güitta-López",
          "Vincenzo Suriani",
          "Jaime Boal",
          "Álvaro J. López-López",
          "Daniele Nardi"
        ],
        "abstract": "Title:\n          Boosting Deep Reinforcement Learning with Semantic Knowledge for Robotic Manipulators\n        \n          Deep Reinforcement Learning (DRL) is a powerful framework for solving complex sequential decision-making problems, particularly in robotic control. However, its practical deployment is often hindered by the substantial amount of experience required for learning, which results in high computational and time costs. In this work, we propose a novel integration of DRL with semantic knowledge in the form of Knowledge Graph Embeddings (KGEs), aiming to enhance learning efficiency by providing contextual information to the agent. Our architecture combines KGEs with visual observations, enabling the agent to exploit environmental knowledge during training. Experimental validation with robotic manipulators in environments featuring both fixed and randomized target attributes demonstrates that our method achieves up to {60}{\\%} reduction in learning time and improves task accuracy by approximately 15 percentage points, without increasing training time or computational complexity. These results highlight the potential of semantic knowledge to reduce sample complexity and improve the effectiveness of DRL in robotic applications.",
        "link": "https://arxiv.org/abs/2601.16866",
        "submittedDate": "2026-01-26T11:10:37.482Z"
      },
      {
        "id": "2601.16870",
        "title": "A Multimodal Data Collection Framework for Dialogue-Driven Assistive Robotics to Clarify Ambiguities: A Wizard-of-Oz Pilot Study",
        "authors": [
          "Guangping Liu",
          "Nicholas Hawkins",
          "Billy Madden",
          "Tipu Sultan",
          "Flavio Esposito",
          "Madi Babaiasl"
        ],
        "abstract": "Title:\n          A Multimodal Data Collection Framework for Dialogue-Driven Assistive Robotics to Clarify Ambiguities: A Wizard-of-Oz Pilot Study\n        \n          Integrated control of wheelchairs and wheelchair-mounted robotic arms (WMRAs) has strong potential to increase independence for users with severe motor limitations, yet existing interfaces often lack the flexibility needed for intuitive assistive interaction. Although data-driven AI methods show promise, progress is limited by the lack of multimodal datasets that capture natural Human-Robot Interaction (HRI), particularly conversational ambiguity in dialogue-driven control. To address this gap, we propose a multimodal data collection framework that employs a dialogue-based interaction protocol and a two-room Wizard-of-Oz (WoZ) setup to simulate robot autonomy while eliciting natural user behavior. The framework records five synchronized modalities: RGB-D video, conversational audio, inertial measurement unit (IMU) signals, end-effector Cartesian pose, and whole-body joint states across five assistive tasks. Using this framework, we collected a pilot dataset of 53 trials from five participants and validated its quality through motion smoothness analysis and user feedback. The results show that the framework effectively captures diverse ambiguity types and supports natural dialogue-driven interaction, demonstrating its suitability for scaling to a larger dataset for learning, benchmarking, and evaluation of ambiguity-aware assistive control.",
        "link": "https://arxiv.org/abs/2601.16870",
        "submittedDate": "2026-01-26T11:10:37.482Z"
      },
      {
        "id": "2411.12150",
        "title": "HEIGHT: Heterogeneous Interaction Graph Transformer for Robot Navigation in Crowded and Constrained Environments",
        "authors": [
          "Shuijing Liu",
          "Haochen Xia",
          "Fatemeh Cheraghi Pouria",
          "Kaiwen Hong",
          "Neeloy Chakraborty",
          "Zichao Hu",
          "Joydeep Biswas",
          "Katherine Driggs-Campbell"
        ],
        "abstract": "Title:\n          HEIGHT: Heterogeneous Interaction Graph Transformer for Robot Navigation in Crowded and Constrained Environments\n        Comments:\n          Accepted to IEEE Transactions of Automation Science and Engineering (T-ASE)\n        \n          We study the problem of robot navigation in dense and interactive crowds with static constraints such as corridors and furniture. Previous methods fail to consider all types of spatial and temporal interactions among agents and obstacles, leading to unsafe and inefficient robot paths. In this article, we leverage a graph-based representation of crowded and constrained scenarios and propose a structured framework to learn robot navigation policies with deep reinforcement learning. We first split the representations of different inputs and propose a heterogeneous spatio-temporal graph to model distinct interactions among humans, robots, and obstacles. Based on the heterogeneous spatio-temporal graph, we propose HEIGHT, a novel navigation policy network architecture with different components to capture heterogeneous interactions through space and time. HEIGHT utilizes attention mechanisms to prioritize important interactions and a recurrent network to track changes in the dynamic scene over time, encouraging the robot to avoid collisions adaptively. Through extensive simulation and real-world experiments, we demonstrate that HEIGHT outperforms state-of-the-art baselines in terms of success, navigation time, and generalization to domain shifts in challenging navigation scenarios. More information is available at this https URL.",
        "link": "https://arxiv.org/abs/2411.12150",
        "submittedDate": "2026-01-26T11:10:37.483Z"
      },
      {
        "id": "2601.12395",
        "title": "XR$^3$: An Extended Reality Platform for Social-Physical Human-Robot Interaction",
        "authors": [
          "Chao Wang",
          "Anna Belardinelli",
          "Michael Gienger"
        ],
        "abstract": "Title:\n          XR$^3$: An Extended Reality Platform for Social-Physical Human-Robot Interaction\n        Comments:\n          7 pages, 4 figures\n        \n          Social-physical human-robot interaction (spHRI) is difficult to study: building and programming robots that integrate multiple interaction modalities is costly and slow, while VR-based prototypes often lack physical contact, breaking users' visuo-tactile expectations. We present XR$^3$, a co-located dual-VR-headset platform for HRI research in which an attendee and a hidden operator share the same physical space while experiencing different virtual embodiments. The attendee sees an expressive virtual robot that interacts face-to-face in a shared virtual environment. In real time, the robot's upper-body motion, head and gaze behavior, and facial expressions are mapped from the operator's tracked limbs and face signals. Because the operator is co-present and calibrated in the same coordinate frame, the operator can also touch the attendee, enabling perceived robot touch synchronized with the robot's visible hands. Finger and hand motion is mapped to the robot avatar using inverse kinematics to support precise contact. Beyond motion retargeting, XR$^3$ supports social retargeting of multiple nonverbal cues that can be experimentally varied while keeping physical interaction constant. We detail the system design and calibration, and demonstrate the platform in a touch-based Wizard-of-Oz study, lowering the barrier to prototyping and evaluating embodied, contact-based robot behaviors.",
        "link": "https://arxiv.org/abs/2601.12395",
        "submittedDate": "2026-01-26T11:10:37.483Z"
      },
      {
        "id": "2601.16035",
        "title": "Collision-Free Humanoid Traversal in Cluttered Indoor Scenes",
        "authors": [
          "Han Xue",
          "Sikai Liang",
          "Zhikai Zhang",
          "Zicheng Zeng",
          "Yun Liu",
          "Yunrui Lian",
          "Jilong Wang",
          "Qingtao Liu",
          "Xuesong Shi",
          "Li Yi"
        ],
        "abstract": "Title:\n          Collision-Free Humanoid Traversal in Cluttered Indoor Scenes\n        \n          We study the problem of collision-free humanoid traversal in cluttered indoor scenes, such as hurdling over objects scattered on the floor, crouching under low-hanging obstacles, or squeezing through narrow passages. To achieve this goal, the humanoid needs to map its perception of surrounding obstacles with diverse spatial layouts and geometries to the corresponding traversal skills. However, the lack of an effective representation that captures humanoid-obstacle relationships during collision avoidance makes directly learning such mappings difficult. We therefore propose Humanoid Potential Field (HumanoidPF), which encodes these relationships as collision-free motion directions, significantly facilitating RL-based traversal skill learning. We also find that HumanoidPF exhibits a surprisingly negligible sim-to-real gap as a perceptual representation. To further enable generalizable traversal skills through diverse and challenging cluttered indoor scenes, we further propose a hybrid scene generation method, incorporating crops of realistic 3D indoor scenes and procedurally synthesized obstacles. We successfully transfer our policy to the real world and develop a teleoperation system where users could command the humanoid to traverse in cluttered indoor scenes with just a single click. Extensive experiments are conducted in both simulation and the real world to validate the effectiveness of our method. Demos and code can be found in our website: this https URL.",
        "link": "https://arxiv.org/abs/2601.16035",
        "submittedDate": "2026-01-26T11:10:37.483Z"
      }
    ]
  },
  "total_count": 24
}